C:\Programming\Anaconda3-4.2.0\python.exe C:/Users/Alex/Repositories/MusicSymbolClassifier/HomusTrainer/TrainModel.py --delete_and_recreate_dataset_directory False --model_name vgg4 --height 192 --width 96
Using TensorFlow backend.
Training on dataset...
Found 12170 images belonging to 32 classes.
Found 1515 images belonging to 32 classes.
Found 1515 images belonging to 32 classes.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 192, 96, 32)       896       
_________________________________________________________________
batch_normalization_1 (Batch (None, 192, 96, 32)       128       
_________________________________________________________________
activation_1 (Activation)    (None, 192, 96, 32)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 192, 96, 32)       9248      
_________________________________________________________________
batch_normalization_2 (Batch (None, 192, 96, 32)       128       
_________________________________________________________________
activation_2 (Activation)    (None, 192, 96, 32)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 96, 48, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 96, 48, 64)        18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 96, 48, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 96, 48, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 96, 48, 64)        36928     
_________________________________________________________________
batch_normalization_4 (Batch (None, 96, 48, 64)        256       
_________________________________________________________________
activation_4 (Activation)    (None, 96, 48, 64)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 48, 24, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 48, 24, 128)       73856     
_________________________________________________________________
batch_normalization_5 (Batch (None, 48, 24, 128)       512       
_________________________________________________________________
activation_5 (Activation)    (None, 48, 24, 128)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 48, 24, 128)       147584    
_________________________________________________________________
batch_normalization_6 (Batch (None, 48, 24, 128)       512       
_________________________________________________________________
activation_6 (Activation)    (None, 48, 24, 128)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 48, 24, 128)       147584    
_________________________________________________________________
batch_normalization_7 (Batch (None, 48, 24, 128)       512       
_________________________________________________________________
activation_7 (Activation)    (None, 48, 24, 128)       0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 24, 12, 128)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 24, 12, 256)       295168    
_________________________________________________________________
batch_normalization_8 (Batch (None, 24, 12, 256)       1024      
_________________________________________________________________
activation_8 (Activation)    (None, 24, 12, 256)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 24, 12, 256)       590080    
_________________________________________________________________
batch_normalization_9 (Batch (None, 24, 12, 256)       1024      
_________________________________________________________________
activation_9 (Activation)    (None, 24, 12, 256)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 24, 12, 256)       590080    
_________________________________________________________________
batch_normalization_10 (Batc (None, 24, 12, 256)       1024      
_________________________________________________________________
activation_10 (Activation)   (None, 24, 12, 256)       0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 12, 6, 256)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 12, 6, 512)        1180160   
_________________________________________________________________
batch_normalization_11 (Batc (None, 12, 6, 512)        2048      
_________________________________________________________________
activation_11 (Activation)   (None, 12, 6, 512)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 12, 6, 512)        2359808   
_________________________________________________________________
batch_normalization_12 (Batc (None, 12, 6, 512)        2048      
_________________________________________________________________
activation_12 (Activation)   (None, 12, 6, 512)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 12, 6, 512)        2359808   
_________________________________________________________________
batch_normalization_13 (Batc (None, 12, 6, 512)        2048      
_________________________________________________________________
activation_13 (Activation)   (None, 12, 6, 512)        0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 6, 3, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 9216)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                294944    
_________________________________________________________________
output_node (Activation)     (None, 32)                0         
=================================================================
Total params: 8,116,160
Trainable params: 8,110,400
Non-trainable params: 5,760
_________________________________________________________________
Model vgg4 loaded.
2017-06-04 19:11:12.648594: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE instructions, but these are available on your machine and could speed up CPU computations.
2017-06-04 19:11:12.648842: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE2 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-04 19:11:12.649075: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE3 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-04 19:11:12.649306: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE4.1 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-04 19:11:12.649541: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE4.2 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-04 19:11:12.649775: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use AVX instructions, but these are available on your machine and could speed up CPU computations.
2017-06-04 19:11:12.650007: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use AVX2 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-04 19:11:12.650292: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use FMA instructions, but these are available on your machine and could speed up CPU computations.
2017-06-04 19:11:12.968323: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:887] Found device 0 with properties: 
name: GeForce GTX 1080 Ti
major: 6 minor: 1 memoryClockRate (GHz) 1.582
pciBusID 0000:01:00.0
Total memory: 11.00GiB
Free memory: 9.12GiB
2017-06-04 19:11:12.968593: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:908] DMA: 0 
2017-06-04 19:11:12.968743: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:918] 0:   Y 
2017-06-04 19:11:12.968883: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:977] Creating TensorFlow device (/gpu:0) -> (device: 0, name: GeForce GTX 1080 Ti, pci bus id: 0000:01:00.0)
Training for 200 epochs with initial learning rate of 0.01, weight-decay of 0.0001 and Nesterov Momentum of 0.9 ...
Additional parameters: Initialization: glorot_uniform, Minibatch-size: 64, Early stopping after 20 epochs without improvement
Data-Shape: (192, 96, 3), Reducing learning rate by factor to 0.5 respectively if not improved validation accuracy after 8 epochs
Data-augmentation: Zooming 20.0% randomly, rotating 10° randomly
Optimizer: Adadelta, with parameters {'lr': 1.0, 'rho': 0.95, 'epsilon': 1e-08, 'decay': 0.0}
Epoch 1/200
 10/191 [>.............................] - ETA: 129s - loss: 5.7511 - acc: 0.09382017-06-04 19:11:27.552281: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\pool_allocator.cc:247] PoolAllocator: After 3729 get requests, put_count=3727 evicted_count=1000 eviction_rate=0.268312 and unsatisfied allocation rate=0.295522
2017-06-04 19:11:27.552560: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
190/191 [============================>.] - ETA: 0s - loss: 1.9100 - acc: 0.5488Epoch 00000: val_acc improved from -inf to 0.33201, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 51s - loss: 1.9048 - acc: 0.5502 - val_loss: 4.6739 - val_acc: 0.3320
Epoch 2/200
190/191 [============================>.] - ETA: 0s - loss: 0.7668 - acc: 0.8254Epoch 00001: val_acc improved from 0.33201 to 0.70165, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 45s - loss: 0.7656 - acc: 0.8253 - val_loss: 1.8370 - val_acc: 0.7017
Epoch 3/200
190/191 [============================>.] - ETA: 0s - loss: 0.6228 - acc: 0.8704Epoch 00002: val_acc did not improve
191/191 [==============================] - 45s - loss: 0.6224 - acc: 0.8700 - val_loss: 4.3772 - val_acc: 0.4403
Epoch 4/200
190/191 [============================>.] - ETA: 0s - loss: 0.5361 - acc: 0.9019Epoch 00003: val_acc did not improve
191/191 [==============================] - 45s - loss: 0.5365 - acc: 0.9014 - val_loss: 4.1372 - val_acc: 0.4937
Epoch 5/200
190/191 [============================>.] - ETA: 0s - loss: 0.4990 - acc: 0.9122Epoch 00004: val_acc did not improve
191/191 [==============================] - 45s - loss: 0.4994 - acc: 0.9121 - val_loss: 2.7647 - val_acc: 0.6231
Epoch 6/200
190/191 [============================>.] - ETA: 0s - loss: 0.4594 - acc: 0.9261Epoch 00005: val_acc did not improve
191/191 [==============================] - 45s - loss: 0.4587 - acc: 0.9265 - val_loss: 13.7266 - val_acc: 0.0957
Epoch 7/200
190/191 [============================>.] - ETA: 0s - loss: 0.4212 - acc: 0.9372Epoch 00006: val_acc improved from 0.70165 to 0.84686, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 46s - loss: 0.4204 - acc: 0.9375 - val_loss: 0.8056 - val_acc: 0.8469
Epoch 8/200
190/191 [============================>.] - ETA: 0s - loss: 0.3981 - acc: 0.9422Epoch 00007: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.3998 - acc: 0.9414 - val_loss: 5.1461 - val_acc: 0.4119
Epoch 9/200
190/191 [============================>.] - ETA: 0s - loss: 0.3878 - acc: 0.9448Epoch 00008: val_acc improved from 0.84686 to 0.85347, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 46s - loss: 0.3888 - acc: 0.9446 - val_loss: 0.7533 - val_acc: 0.8535
Epoch 10/200
190/191 [============================>.] - ETA: 0s - loss: 0.3524 - acc: 0.9557Epoch 00009: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.3529 - acc: 0.9554 - val_loss: 2.7317 - val_acc: 0.5690
Epoch 11/200
190/191 [============================>.] - ETA: 0s - loss: 0.3524 - acc: 0.9542Epoch 00010: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.3530 - acc: 0.9534 - val_loss: 3.4312 - val_acc: 0.4574
Epoch 12/200
190/191 [============================>.] - ETA: 0s - loss: 0.3339 - acc: 0.9599Epoch 00011: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.3340 - acc: 0.9596 - val_loss: 12.7742 - val_acc: 0.1789
Epoch 13/200
190/191 [============================>.] - ETA: 0s - loss: 0.3147 - acc: 0.9644Epoch 00012: val_acc improved from 0.85347 to 0.87657, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 46s - loss: 0.3150 - acc: 0.9641 - val_loss: 0.6797 - val_acc: 0.8766
Epoch 14/200
190/191 [============================>.] - ETA: 0s - loss: 0.2981 - acc: 0.9676Epoch 00013: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.2993 - acc: 0.9672 - val_loss: 1.0273 - val_acc: 0.7815
Epoch 15/200
190/191 [============================>.] - ETA: 0s - loss: 0.2886 - acc: 0.9665Epoch 00014: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.2898 - acc: 0.9657 - val_loss: 1.0437 - val_acc: 0.8277
Epoch 16/200
190/191 [============================>.] - ETA: 0s - loss: 0.2795 - acc: 0.9697Epoch 00015: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.2791 - acc: 0.9699 - val_loss: 9.9702 - val_acc: 0.2832
Epoch 17/200
190/191 [============================>.] - ETA: 0s - loss: 0.2769 - acc: 0.9692Epoch 00016: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.2765 - acc: 0.9693 - val_loss: 1.4795 - val_acc: 0.7558
Epoch 18/200
190/191 [============================>.] - ETA: 0s - loss: 0.2570 - acc: 0.9739Epoch 00017: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.2572 - acc: 0.9735 - val_loss: 3.8521 - val_acc: 0.4277
Epoch 19/200
190/191 [============================>.] - ETA: 0s - loss: 0.2537 - acc: 0.9738Epoch 00018: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.2533 - acc: 0.9739 - val_loss: 1.2344 - val_acc: 0.7637
Epoch 20/200
190/191 [============================>.] - ETA: 0s - loss: 0.2520 - acc: 0.9728Epoch 00019: val_acc improved from 0.87657 to 0.94455, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 46s - loss: 0.2516 - acc: 0.9729 - val_loss: 0.3529 - val_acc: 0.9446
Epoch 21/200
190/191 [============================>.] - ETA: 0s - loss: 0.2373 - acc: 0.9767Epoch 00020: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.2369 - acc: 0.9768 - val_loss: 0.3922 - val_acc: 0.9248
Epoch 22/200
190/191 [============================>.] - ETA: 0s - loss: 0.2330 - acc: 0.9779Epoch 00021: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.2337 - acc: 0.9775 - val_loss: 1.8448 - val_acc: 0.6634
Epoch 23/200
190/191 [============================>.] - ETA: 0s - loss: 0.2210 - acc: 0.9790Epoch 00022: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.2215 - acc: 0.9786 - val_loss: 0.4782 - val_acc: 0.9010
Epoch 24/200
190/191 [============================>.] - ETA: 0s - loss: 0.2229 - acc: 0.9770Epoch 00023: val_acc improved from 0.94455 to 0.96172, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 46s - loss: 0.2225 - acc: 0.9771 - val_loss: 0.2776 - val_acc: 0.9617
Epoch 25/200
190/191 [============================>.] - ETA: 0s - loss: 0.2133 - acc: 0.9793Epoch 00024: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.2132 - acc: 0.9794 - val_loss: 0.4032 - val_acc: 0.9195
Epoch 26/200
190/191 [============================>.] - ETA: 0s - loss: 0.2069 - acc: 0.9801Epoch 00025: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.2067 - acc: 0.9802 - val_loss: 11.7622 - val_acc: 0.1795
Epoch 27/200
190/191 [============================>.] - ETA: 0s - loss: 0.1945 - acc: 0.9845Epoch 00026: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1947 - acc: 0.9846 - val_loss: 0.5537 - val_acc: 0.8805
Epoch 28/200
190/191 [============================>.] - ETA: 0s - loss: 0.1988 - acc: 0.9829Epoch 00027: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1985 - acc: 0.9830 - val_loss: 0.3317 - val_acc: 0.9545
Epoch 29/200
190/191 [============================>.] - ETA: 0s - loss: 0.1931 - acc: 0.9817Epoch 00028: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1936 - acc: 0.9813 - val_loss: 6.2756 - val_acc: 0.3894
Epoch 30/200
190/191 [============================>.] - ETA: 0s - loss: 0.1840 - acc: 0.9854Epoch 00029: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1838 - acc: 0.9855 - val_loss: 0.4151 - val_acc: 0.9188
Epoch 31/200
190/191 [============================>.] - ETA: 0s - loss: 0.1819 - acc: 0.9838Epoch 00030: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1849 - acc: 0.9828 - val_loss: 1.5064 - val_acc: 0.8040
Epoch 32/200
190/191 [============================>.] - ETA: 0s - loss: 0.1786 - acc: 0.9850Epoch 00031: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1784 - acc: 0.9851 - val_loss: 0.2717 - val_acc: 0.9584
Epoch 33/200
190/191 [============================>.] - ETA: 0s - loss: 0.1817 - acc: 0.9839Epoch 00032: val_acc did not improve

Epoch 00032: reducing learning rate to 0.5.
191/191 [==============================] - 46s - loss: 0.1815 - acc: 0.9840 - val_loss: 0.3313 - val_acc: 0.9452
Epoch 34/200
190/191 [============================>.] - ETA: 0s - loss: 0.1507 - acc: 0.9929Epoch 00033: val_acc improved from 0.96172 to 0.97096, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 46s - loss: 0.1506 - acc: 0.9930 - val_loss: 0.2343 - val_acc: 0.9710
Epoch 35/200
190/191 [============================>.] - ETA: 0s - loss: 0.1405 - acc: 0.9951Epoch 00034: val_acc improved from 0.97096 to 0.97360, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 46s - loss: 0.1404 - acc: 0.9952 - val_loss: 0.2175 - val_acc: 0.9736
Epoch 36/200
190/191 [============================>.] - ETA: 0s - loss: 0.1347 - acc: 0.9958Epoch 00035: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1350 - acc: 0.9958 - val_loss: 0.3138 - val_acc: 0.9564
Epoch 37/200
190/191 [============================>.] - ETA: 0s - loss: 0.1342 - acc: 0.9953Epoch 00036: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1354 - acc: 0.9948 - val_loss: 0.3310 - val_acc: 0.9492
Epoch 38/200
190/191 [============================>.] - ETA: 0s - loss: 0.1314 - acc: 0.9958Epoch 00037: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1314 - acc: 0.9958 - val_loss: 0.2782 - val_acc: 0.9644
Epoch 39/200
190/191 [============================>.] - ETA: 0s - loss: 0.1266 - acc: 0.9969Epoch 00038: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1268 - acc: 0.9969 - val_loss: 0.2319 - val_acc: 0.9710
Epoch 40/200
190/191 [============================>.] - ETA: 0s - loss: 0.1264 - acc: 0.9960Epoch 00039: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1268 - acc: 0.9955 - val_loss: 0.3118 - val_acc: 0.9545
Epoch 41/200
190/191 [============================>.] - ETA: 0s - loss: 0.1217 - acc: 0.9965Epoch 00040: val_acc improved from 0.97360 to 0.97558, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 46s - loss: 0.1216 - acc: 0.9965 - val_loss: 0.1992 - val_acc: 0.9756
Epoch 42/200
190/191 [============================>.] - ETA: 0s - loss: 0.1175 - acc: 0.9973Epoch 00041: val_acc improved from 0.97558 to 0.97690, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 46s - loss: 0.1175 - acc: 0.9973 - val_loss: 0.2198 - val_acc: 0.9769
Epoch 43/200
190/191 [============================>.] - ETA: 0s - loss: 0.1154 - acc: 0.9975Epoch 00042: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1156 - acc: 0.9975 - val_loss: 0.3721 - val_acc: 0.9446
Epoch 44/200
190/191 [============================>.] - ETA: 0s - loss: 0.1193 - acc: 0.9949Epoch 00043: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1192 - acc: 0.9949 - val_loss: 0.3304 - val_acc: 0.9584
Epoch 45/200
190/191 [============================>.] - ETA: 0s - loss: 0.1144 - acc: 0.9961Epoch 00044: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1143 - acc: 0.9961 - val_loss: 0.2980 - val_acc: 0.9505
Epoch 46/200
190/191 [============================>.] - ETA: 0s - loss: 0.1131 - acc: 0.9958Epoch 00045: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1131 - acc: 0.9958 - val_loss: 0.2656 - val_acc: 0.9696
Epoch 47/200
190/191 [============================>.] - ETA: 0s - loss: 0.1091 - acc: 0.9965Epoch 00046: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1092 - acc: 0.9966 - val_loss: 0.2602 - val_acc: 0.9564
Epoch 48/200
190/191 [============================>.] - ETA: 0s - loss: 0.1056 - acc: 0.9973Epoch 00047: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1056 - acc: 0.9973 - val_loss: 0.2542 - val_acc: 0.9611
Epoch 49/200
190/191 [============================>.] - ETA: 0s - loss: 0.1062 - acc: 0.9962Epoch 00048: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1061 - acc: 0.9962 - val_loss: 0.2670 - val_acc: 0.9624
Epoch 50/200
190/191 [============================>.] - ETA: 0s - loss: 0.1048 - acc: 0.9968Epoch 00049: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.1048 - acc: 0.9968 - val_loss: 0.2391 - val_acc: 0.9611
Epoch 51/200
190/191 [============================>.] - ETA: 0s - loss: 0.1026 - acc: 0.9961Epoch 00050: val_acc did not improve

Epoch 00050: reducing learning rate to 0.25.
191/191 [==============================] - 46s - loss: 0.1026 - acc: 0.9961 - val_loss: 0.2597 - val_acc: 0.9696
Epoch 52/200
190/191 [============================>.] - ETA: 0s - loss: 0.0965 - acc: 0.9982Epoch 00051: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0965 - acc: 0.9982 - val_loss: 0.2036 - val_acc: 0.9769
Epoch 53/200
190/191 [============================>.] - ETA: 0s - loss: 0.0942 - acc: 0.9985Epoch 00052: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0942 - acc: 0.9985 - val_loss: 0.2001 - val_acc: 0.9762
Epoch 54/200
190/191 [============================>.] - ETA: 0s - loss: 0.0935 - acc: 0.9984Epoch 00053: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0941 - acc: 0.9979 - val_loss: 0.2281 - val_acc: 0.9743
Epoch 55/200
190/191 [============================>.] - ETA: 0s - loss: 0.0923 - acc: 0.9987Epoch 00054: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0923 - acc: 0.9987 - val_loss: 0.2101 - val_acc: 0.9729
Epoch 56/200
190/191 [============================>.] - ETA: 0s - loss: 0.0910 - acc: 0.9984Epoch 00055: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0910 - acc: 0.9984 - val_loss: 0.1993 - val_acc: 0.9756
Epoch 57/200
190/191 [============================>.] - ETA: 0s - loss: 0.0891 - acc: 0.9988Epoch 00056: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0891 - acc: 0.9989 - val_loss: 0.2168 - val_acc: 0.9710
Epoch 58/200
190/191 [============================>.] - ETA: 0s - loss: 0.0881 - acc: 0.9993Epoch 00057: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0881 - acc: 0.9993 - val_loss: 0.2170 - val_acc: 0.9743
Epoch 59/200
190/191 [============================>.] - ETA: 0s - loss: 0.0860 - acc: 0.9993Epoch 00058: val_acc improved from 0.97690 to 0.97888, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 46s - loss: 0.0860 - acc: 0.9993 - val_loss: 0.1894 - val_acc: 0.9789
Epoch 60/200
190/191 [============================>.] - ETA: 0s - loss: 0.0848 - acc: 0.9993Epoch 00059: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0848 - acc: 0.9993 - val_loss: 0.2020 - val_acc: 0.9736
Epoch 61/200
190/191 [============================>.] - ETA: 0s - loss: 0.0843 - acc: 0.9991Epoch 00060: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0843 - acc: 0.9991 - val_loss: 0.1813 - val_acc: 0.9756
Epoch 62/200
190/191 [============================>.] - ETA: 0s - loss: 0.0831 - acc: 0.9994Epoch 00061: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0831 - acc: 0.9994 - val_loss: 0.1879 - val_acc: 0.9789
Epoch 63/200
190/191 [============================>.] - ETA: 0s - loss: 0.0819 - acc: 0.9989Epoch 00062: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0819 - acc: 0.9989 - val_loss: 0.2158 - val_acc: 0.9716
Epoch 64/200
190/191 [============================>.] - ETA: 0s - loss: 0.0813 - acc: 0.9986Epoch 00063: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0813 - acc: 0.9986 - val_loss: 0.1940 - val_acc: 0.9723
Epoch 65/200
190/191 [============================>.] - ETA: 0s - loss: 0.0799 - acc: 0.9988Epoch 00064: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0798 - acc: 0.9988 - val_loss: 0.2051 - val_acc: 0.9756
Epoch 66/200
190/191 [============================>.] - ETA: 0s - loss: 0.0779 - acc: 0.9993Epoch 00065: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0780 - acc: 0.9993 - val_loss: 0.2047 - val_acc: 0.9690
Epoch 67/200
190/191 [============================>.] - ETA: 0s - loss: 0.0789 - acc: 0.9986Epoch 00066: val_acc improved from 0.97888 to 0.98218, saving model to 2017-06-04_vgg4.h5
191/191 [==============================] - 46s - loss: 0.0788 - acc: 0.9986 - val_loss: 0.1558 - val_acc: 0.9822
Epoch 68/200
190/191 [============================>.] - ETA: 0s - loss: 0.0780 - acc: 0.9989Epoch 00067: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0780 - acc: 0.9989 - val_loss: 0.1843 - val_acc: 0.9769
Epoch 69/200
190/191 [============================>.] - ETA: 0s - loss: 0.0757 - acc: 0.9993Epoch 00068: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0757 - acc: 0.9993 - val_loss: 0.1884 - val_acc: 0.9749
Epoch 70/200
190/191 [============================>.] - ETA: 0s - loss: 0.0755 - acc: 0.9990Epoch 00069: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0754 - acc: 0.9990 - val_loss: 0.2072 - val_acc: 0.9743
Epoch 71/200
190/191 [============================>.] - ETA: 0s - loss: 0.0750 - acc: 0.9988Epoch 00070: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0750 - acc: 0.9989 - val_loss: 0.2101 - val_acc: 0.9749
Epoch 72/200
190/191 [============================>.] - ETA: 0s - loss: 0.0733 - acc: 0.9992Epoch 00071: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0732 - acc: 0.9992 - val_loss: 0.2109 - val_acc: 0.9729
Epoch 73/200
190/191 [============================>.] - ETA: 0s - loss: 0.0738 - acc: 0.9989Epoch 00072: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0738 - acc: 0.9989 - val_loss: 0.2065 - val_acc: 0.9723
Epoch 74/200
190/191 [============================>.] - ETA: 0s - loss: 0.0723 - acc: 0.9989Epoch 00073: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0723 - acc: 0.9989 - val_loss: 0.1875 - val_acc: 0.9736
Epoch 75/200
190/191 [============================>.] - ETA: 0s - loss: 0.0705 - acc: 0.9995Epoch 00074: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0704 - acc: 0.9995 - val_loss: 0.1721 - val_acc: 0.9776
Epoch 76/200
190/191 [============================>.] - ETA: 0s - loss: 0.0714 - acc: 0.9986Epoch 00075: val_acc did not improve

Epoch 00075: reducing learning rate to 0.125.
191/191 [==============================] - 46s - loss: 0.0715 - acc: 0.9986 - val_loss: 0.2268 - val_acc: 0.9736
Epoch 77/200
190/191 [============================>.] - ETA: 0s - loss: 0.0688 - acc: 0.9993Epoch 00076: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0688 - acc: 0.9993 - val_loss: 0.1781 - val_acc: 0.9743
Epoch 78/200
190/191 [============================>.] - ETA: 0s - loss: 0.0677 - acc: 0.9996Epoch 00077: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0677 - acc: 0.9996 - val_loss: 0.2056 - val_acc: 0.9743
Epoch 79/200
190/191 [============================>.] - ETA: 0s - loss: 0.0677 - acc: 0.9993Epoch 00078: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0677 - acc: 0.9993 - val_loss: 0.1883 - val_acc: 0.9776
Epoch 80/200
190/191 [============================>.] - ETA: 0s - loss: 0.0673 - acc: 0.9995Epoch 00079: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0672 - acc: 0.9995 - val_loss: 0.1692 - val_acc: 0.9789
Epoch 81/200
190/191 [============================>.] - ETA: 0s - loss: 0.0665 - acc: 0.9995Epoch 00080: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0665 - acc: 0.9995 - val_loss: 0.2062 - val_acc: 0.9729
Epoch 82/200
190/191 [============================>.] - ETA: 0s - loss: 0.0667 - acc: 0.9993Epoch 00081: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0667 - acc: 0.9993 - val_loss: 0.1663 - val_acc: 0.9762
Epoch 83/200
190/191 [============================>.] - ETA: 0s - loss: 0.0653 - acc: 0.9998Epoch 00082: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0653 - acc: 0.9998 - val_loss: 0.1882 - val_acc: 0.9729
Epoch 84/200
190/191 [============================>.] - ETA: 0s - loss: 0.0661 - acc: 0.9991Epoch 00083: val_acc did not improve

Epoch 00083: reducing learning rate to 0.0625.
191/191 [==============================] - 46s - loss: 0.0661 - acc: 0.9991 - val_loss: 0.2017 - val_acc: 0.9729
Epoch 85/200
190/191 [============================>.] - ETA: 0s - loss: 0.0654 - acc: 0.9993Epoch 00084: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0654 - acc: 0.9993 - val_loss: 0.1851 - val_acc: 0.9762
Epoch 86/200
190/191 [============================>.] - ETA: 0s - loss: 0.0642 - acc: 0.9998Epoch 00085: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0642 - acc: 0.9998 - val_loss: 0.1787 - val_acc: 0.9769
Epoch 87/200
190/191 [============================>.] - ETA: 0s - loss: 0.0641 - acc: 0.9998Epoch 00086: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0641 - acc: 0.9998 - val_loss: 0.1924 - val_acc: 0.9743
Epoch 88/200
190/191 [============================>.] - ETA: 0s - loss: 0.0646 - acc: 0.9994Epoch 00087: val_acc did not improve
191/191 [==============================] - 46s - loss: 0.0646 - acc: 0.9994 - val_loss: 0.1847 - val_acc: 0.9749
Epoch 00087: early stopping
Loading best model from check-point and testing...
                 precision    recall  f1-score   support

         G-Clef       1.00      1.00      1.00        40
   Quarter-Note       1.00      1.00      1.00        39
        Barline       0.97      0.97      0.97        40
       2-4-Time       1.00      0.97      0.99        40
       6-8-Time       1.00      1.00      1.00        40
         C-Clef       1.00      1.00      1.00        40
       Cut-Time       0.95      1.00      0.98        40
Sixty-Four-Rest       1.00      0.97      0.99        40
       3-8-Time       0.98      1.00      0.99        40
           Flat       1.00      1.00      1.00        40
        Natural       1.00      0.97      0.99        40
Whole-Half-Rest       1.00      0.97      0.99        40
Thirty-Two-Note       0.97      0.97      0.97        40
          Sharp       1.00      0.97      0.99        40
      Half-Note       0.99      0.97      0.98        80
         F-Clef       1.00      0.97      0.99        40
       3-4-Time       1.00      1.00      1.00        40
   Quarter-Rest       1.00      1.00      1.00        39
    Common-Time       0.98      1.00      0.99        40
      12-8-Time       1.00      0.99      0.99        79
   Double-Sharp       0.97      0.97      0.97        40
     Whole-Note       0.99      1.00      0.99        80
       4-4-Time       0.92      0.90      0.91        40
       2-2-Time       0.98      1.00      0.99        40
    Eighth-Rest       0.95      0.99      0.97        80
Thirty-Two-Rest       0.97      0.90      0.94        40
 Sixteenth-Note       0.90      0.96      0.93        79
    Eighth-Note       0.97      0.95      0.96        40
            Dot       0.95      0.89      0.92        79
Sixty-Four-Note       0.91      0.97      0.94        40
 Sixteenth-Rest       0.97      0.97      0.97        40
       9-8-Time       0.98      1.00      0.99        40

    avg / total       0.98      0.98      0.98      1515

Total Loss: 0.18079
Total Accuracy: 97.55776%
Total Error: 2.44224%
Execution time: 4089.5s
