C:\Programming\Anaconda3-4.2.0\python.exe C:/Users/Alex/Repositories/MusicSymbolClassifier/HomusTrainer/TrainModel.py --delete_and_recreate_dataset_directory False --model_name vgg
Using TensorFlow backend.
Training on dataset...
Found 48650 images belonging to 32 classes.
Found 6075 images belonging to 32 classes.
Found 6075 images belonging to 32 classes.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 224, 128, 16)      448       
_________________________________________________________________
batch_normalization_1 (Batch (None, 224, 128, 16)      64        
_________________________________________________________________
activation_1 (Activation)    (None, 224, 128, 16)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 224, 128, 16)      2320      
_________________________________________________________________
batch_normalization_2 (Batch (None, 224, 128, 16)      64        
_________________________________________________________________
activation_2 (Activation)    (None, 224, 128, 16)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 112, 64, 16)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 112, 64, 32)       4640      
_________________________________________________________________
batch_normalization_3 (Batch (None, 112, 64, 32)       128       
_________________________________________________________________
activation_3 (Activation)    (None, 112, 64, 32)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 112, 64, 32)       9248      
_________________________________________________________________
batch_normalization_4 (Batch (None, 112, 64, 32)       128       
_________________________________________________________________
activation_4 (Activation)    (None, 112, 64, 32)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 56, 32, 32)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 56, 32, 64)        18496     
_________________________________________________________________
batch_normalization_5 (Batch (None, 56, 32, 64)        256       
_________________________________________________________________
activation_5 (Activation)    (None, 56, 32, 64)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 56, 32, 64)        36928     
_________________________________________________________________
batch_normalization_6 (Batch (None, 56, 32, 64)        256       
_________________________________________________________________
activation_6 (Activation)    (None, 56, 32, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 56, 32, 64)        36928     
_________________________________________________________________
batch_normalization_7 (Batch (None, 56, 32, 64)        256       
_________________________________________________________________
activation_7 (Activation)    (None, 56, 32, 64)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 28, 16, 64)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 28, 16, 128)       73856     
_________________________________________________________________
batch_normalization_8 (Batch (None, 28, 16, 128)       512       
_________________________________________________________________
activation_8 (Activation)    (None, 28, 16, 128)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 28, 16, 128)       147584    
_________________________________________________________________
batch_normalization_9 (Batch (None, 28, 16, 128)       512       
_________________________________________________________________
activation_9 (Activation)    (None, 28, 16, 128)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 28, 16, 128)       147584    
_________________________________________________________________
batch_normalization_10 (Batc (None, 28, 16, 128)       512       
_________________________________________________________________
activation_10 (Activation)   (None, 28, 16, 128)       0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 14, 8, 128)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 14, 8, 192)        221376    
_________________________________________________________________
batch_normalization_11 (Batc (None, 14, 8, 192)        768       
_________________________________________________________________
activation_11 (Activation)   (None, 14, 8, 192)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 14, 8, 192)        331968    
_________________________________________________________________
batch_normalization_12 (Batc (None, 14, 8, 192)        768       
_________________________________________________________________
activation_12 (Activation)   (None, 14, 8, 192)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 14, 8, 192)        331968    
_________________________________________________________________
batch_normalization_13 (Batc (None, 14, 8, 192)        768       
_________________________________________________________________
activation_13 (Activation)   (None, 14, 8, 192)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 14, 8, 192)        331968    
_________________________________________________________________
batch_normalization_14 (Batc (None, 14, 8, 192)        768       
_________________________________________________________________
activation_14 (Activation)   (None, 14, 8, 192)        0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 7, 4, 192)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 5376)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                172064    
_________________________________________________________________
output_node (Activation)     (None, 32)                0         
=================================================================
Total params: 1,873,136
Trainable params: 1,870,256
Non-trainable params: 2,880
_________________________________________________________________
Model vgg loaded.
2017-06-02 10:41:39.854952: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE instructions, but these are available on your machine and could speed up CPU computations.
2017-06-02 10:41:39.855178: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE2 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-02 10:41:39.855396: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE3 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-02 10:41:39.855623: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE4.1 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-02 10:41:39.855852: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE4.2 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-02 10:41:39.856083: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use AVX instructions, but these are available on your machine and could speed up CPU computations.
2017-06-02 10:41:39.856308: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use AVX2 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-02 10:41:39.856526: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use FMA instructions, but these are available on your machine and could speed up CPU computations.
2017-06-02 10:41:40.199284: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:887] Found device 0 with properties: 
name: GeForce GTX 1080 Ti
major: 6 minor: 1 memoryClockRate (GHz) 1.582
pciBusID 0000:01:00.0
Total memory: 11.00GiB
Free memory: 9.12GiB
2017-06-02 10:41:40.199547: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:908] DMA: 0 
2017-06-02 10:41:40.199669: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:918] 0:   Y 
2017-06-02 10:41:40.199806: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:977] Creating TensorFlow device (/gpu:0) -> (device: 0, name: GeForce GTX 1080 Ti, pci bus id: 0000:01:00.0)
Training for 200 epochs with initial learning rate of 0.01, weight-decay of 0.0001 and Nesterov Momentum of 0.9 ...
Additional parameters: Initialization: glorot_uniform, Minibatch-size: 128, Early stopping after 20 epochs without improvement
Data-Shape: (224, 128, 3), Reducing learning rate by factor to 0.5 respectively if not improved validation accuracy after 8 epochs
Data-augmentation: Zooming 20.0% randomly, rotating 10° randomly
Optimizer: Adadelta, with parameters {'lr': 1.0, 'rho': 0.95, 'epsilon': 1e-08, 'decay': 0.0}
Epoch 1/200
  9/381 [..............................] - ETA: 372s - loss: 5.0101 - acc: 0.06162017-06-02 10:41:57.559832: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\pool_allocator.cc:247] PoolAllocator: After 3616 get requests, put_count=3568 evicted_count=1000 eviction_rate=0.280269 and unsatisfied allocation rate=0.317478
2017-06-02 10:41:57.560099: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
380/381 [============================>.] - ETA: 0s - loss: 1.1646 - acc: 0.6900Epoch 00000: val_acc improved from -inf to 0.60198, saving model to 2017-06-02_vgg.h5
381/381 [==============================] - 270s - loss: 1.1620 - acc: 0.6909 - val_loss: 2.0885 - val_acc: 0.6020
Epoch 2/200
380/381 [============================>.] - ETA: 0s - loss: 0.4810 - acc: 0.8770Epoch 00001: val_acc did not improve
381/381 [==============================] - 258s - loss: 0.4816 - acc: 0.8768 - val_loss: 2.9627 - val_acc: 0.5954
Epoch 3/200
380/381 [============================>.] - ETA: 0s - loss: 0.3739 - acc: 0.9144Epoch 00002: val_acc improved from 0.60198 to 0.80494, saving model to 2017-06-02_vgg.h5
381/381 [==============================] - 254s - loss: 0.3735 - acc: 0.9146 - val_loss: 0.8763 - val_acc: 0.8049
Epoch 4/200
380/381 [============================>.] - ETA: 0s - loss: 0.3254 - acc: 0.9317Epoch 00003: val_acc improved from 0.80494 to 0.90107, saving model to 2017-06-02_vgg.h5
381/381 [==============================] - 260s - loss: 0.3250 - acc: 0.9319 - val_loss: 0.3910 - val_acc: 0.9011
Epoch 5/200
380/381 [============================>.] - ETA: 0s - loss: 0.2818 - acc: 0.9479Epoch 00004: val_acc improved from 0.90107 to 0.93053, saving model to 2017-06-02_vgg.h5
381/381 [==============================] - 259s - loss: 0.2816 - acc: 0.9481 - val_loss: 0.3437 - val_acc: 0.9305
Epoch 6/200
380/381 [============================>.] - ETA: 0s - loss: 0.2471 - acc: 0.9604Epoch 00005: val_acc did not improve
381/381 [==============================] - 255s - loss: 0.2474 - acc: 0.9603 - val_loss: 0.4569 - val_acc: 0.8974
Epoch 7/200
380/381 [============================>.] - ETA: 0s - loss: 0.2276 - acc: 0.9666Epoch 00006: val_acc did not improve
381/381 [==============================] - 277s - loss: 0.2275 - acc: 0.9667 - val_loss: 0.8808 - val_acc: 0.8568
Epoch 8/200
380/381 [============================>.] - ETA: 0s - loss: 0.2110 - acc: 0.9728Epoch 00007: val_acc improved from 0.93053 to 0.94239, saving model to 2017-06-02_vgg.h5
381/381 [==============================] - 282s - loss: 0.2108 - acc: 0.9729 - val_loss: 0.3666 - val_acc: 0.9424
Epoch 9/200
380/381 [============================>.] - ETA: 0s - loss: 0.1994 - acc: 0.9746Epoch 00008: val_acc did not improve
381/381 [==============================] - 256s - loss: 0.1993 - acc: 0.9747 - val_loss: 0.3079 - val_acc: 0.9378
Epoch 10/200
380/381 [============================>.] - ETA: 0s - loss: 0.1869 - acc: 0.9798Epoch 00009: val_acc improved from 0.94239 to 0.94486, saving model to 2017-06-02_vgg.h5
381/381 [==============================] - 258s - loss: 0.1878 - acc: 0.9796 - val_loss: 0.2959 - val_acc: 0.9449
Epoch 11/200
380/381 [============================>.] - ETA: 0s - loss: 0.1755 - acc: 0.9825Epoch 00010: val_acc improved from 0.94486 to 0.98486, saving model to 2017-06-02_vgg.h5
381/381 [==============================] - 258s - loss: 0.1754 - acc: 0.9826 - val_loss: 0.1704 - val_acc: 0.9849
Epoch 12/200
380/381 [============================>.] - ETA: 0s - loss: 0.1680 - acc: 0.9842Epoch 00011: val_acc did not improve
381/381 [==============================] - 251s - loss: 0.1679 - acc: 0.9842 - val_loss: 0.1700 - val_acc: 0.9811
Epoch 13/200
380/381 [============================>.] - ETA: 0s - loss: 0.1644 - acc: 0.9846Epoch 00012: val_acc did not improve
381/381 [==============================] - 254s - loss: 0.1649 - acc: 0.9843 - val_loss: 4.7153 - val_acc: 0.4100
Epoch 14/200
380/381 [============================>.] - ETA: 0s - loss: 0.1553 - acc: 0.9868Epoch 00013: val_acc did not improve
381/381 [==============================] - 257s - loss: 0.1553 - acc: 0.9868 - val_loss: 0.2737 - val_acc: 0.9557
Epoch 15/200
380/381 [============================>.] - ETA: 0s - loss: 0.1501 - acc: 0.9878Epoch 00014: val_acc did not improve
381/381 [==============================] - 252s - loss: 0.1512 - acc: 0.9875 - val_loss: 0.6437 - val_acc: 0.9116
Epoch 16/200
380/381 [============================>.] - ETA: 0s - loss: 0.1423 - acc: 0.9901Epoch 00015: val_acc improved from 0.98486 to 0.99276, saving model to 2017-06-02_vgg.h5
381/381 [==============================] - 258s - loss: 0.1422 - acc: 0.9901 - val_loss: 0.1323 - val_acc: 0.9928
Epoch 17/200
380/381 [============================>.] - ETA: 0s - loss: 0.1379 - acc: 0.9904Epoch 00016: val_acc did not improve
381/381 [==============================] - 259s - loss: 0.1379 - acc: 0.9905 - val_loss: 0.2195 - val_acc: 0.9620
Epoch 18/200
380/381 [============================>.] - ETA: 0s - loss: 0.1361 - acc: 0.9897Epoch 00017: val_acc did not improve
381/381 [==============================] - 257s - loss: 0.1361 - acc: 0.9897 - val_loss: 0.1479 - val_acc: 0.9873
Epoch 19/200
380/381 [============================>.] - ETA: 0s - loss: 0.1334 - acc: 0.9901Epoch 00018: val_acc did not improve
381/381 [==============================] - 251s - loss: 0.1334 - acc: 0.9901 - val_loss: 0.1723 - val_acc: 0.9758
Epoch 20/200
380/381 [============================>.] - ETA: 0s - loss: 0.1263 - acc: 0.9914Epoch 00019: val_acc did not improve
381/381 [==============================] - 256s - loss: 0.1262 - acc: 0.9914 - val_loss: 0.1360 - val_acc: 0.9878
Epoch 21/200
380/381 [============================>.] - ETA: 0s - loss: 0.1251 - acc: 0.9911Epoch 00020: val_acc did not improve
381/381 [==============================] - 255s - loss: 0.1250 - acc: 0.9911 - val_loss: 0.1417 - val_acc: 0.9827
Epoch 22/200
380/381 [============================>.] - ETA: 0s - loss: 0.1220 - acc: 0.9921Epoch 00021: val_acc did not improve
381/381 [==============================] - 253s - loss: 0.1219 - acc: 0.9922 - val_loss: 0.1433 - val_acc: 0.9829
Epoch 23/200
380/381 [============================>.] - ETA: 0s - loss: 0.1174 - acc: 0.9922Epoch 00022: val_acc did not improve
381/381 [==============================] - 258s - loss: 0.1174 - acc: 0.9923 - val_loss: 0.1146 - val_acc: 0.9921
Epoch 24/200
380/381 [============================>.] - ETA: 0s - loss: 0.1158 - acc: 0.9923Epoch 00023: val_acc did not improve
381/381 [==============================] - 259s - loss: 0.1158 - acc: 0.9923 - val_loss: 0.1723 - val_acc: 0.9737
Epoch 25/200
380/381 [============================>.] - ETA: 0s - loss: 0.1132 - acc: 0.9925Epoch 00024: val_acc did not improve

Epoch 00024: reducing learning rate to 0.5.
381/381 [==============================] - 260s - loss: 0.1132 - acc: 0.9925 - val_loss: 0.1881 - val_acc: 0.9689
Epoch 26/200
380/381 [============================>.] - ETA: 0s - loss: 0.0963 - acc: 0.9972Epoch 00025: val_acc improved from 0.99276 to 0.99654, saving model to 2017-06-02_vgg.h5
381/381 [==============================] - 257s - loss: 0.0964 - acc: 0.9973 - val_loss: 0.0959 - val_acc: 0.9965
Epoch 27/200
380/381 [============================>.] - ETA: 0s - loss: 0.0920 - acc: 0.9979Epoch 00026: val_acc did not improve
381/381 [==============================] - 258s - loss: 0.0920 - acc: 0.9979 - val_loss: 0.0962 - val_acc: 0.9962
Epoch 28/200
380/381 [============================>.] - ETA: 0s - loss: 0.0885 - acc: 0.9980Epoch 00027: val_acc improved from 0.99654 to 0.99918, saving model to 2017-06-02_vgg.h5
381/381 [==============================] - 254s - loss: 0.0886 - acc: 0.9981 - val_loss: 0.0854 - val_acc: 0.9992
Epoch 29/200
380/381 [============================>.] - ETA: 0s - loss: 0.0849 - acc: 0.9986Epoch 00028: val_acc did not improve
381/381 [==============================] - 259s - loss: 0.0849 - acc: 0.9986 - val_loss: 0.0843 - val_acc: 0.9987
Epoch 30/200
380/381 [============================>.] - ETA: 0s - loss: 0.0830 - acc: 0.9984Epoch 00029: val_acc did not improve
381/381 [==============================] - 253s - loss: 0.0830 - acc: 0.9984 - val_loss: 0.0840 - val_acc: 0.9984
Epoch 31/200
380/381 [============================>.] - ETA: 0s - loss: 0.0805 - acc: 0.9983Epoch 00030: val_acc did not improve
381/381 [==============================] - 254s - loss: 0.0804 - acc: 0.9983 - val_loss: 0.0782 - val_acc: 0.9988
Epoch 32/200
380/381 [============================>.] - ETA: 0s - loss: 0.0772 - acc: 0.9987Epoch 00031: val_acc did not improve
381/381 [==============================] - 251s - loss: 0.0773 - acc: 0.9987 - val_loss: 0.0908 - val_acc: 0.9931
Epoch 33/200
380/381 [============================>.] - ETA: 0s - loss: 0.0756 - acc: 0.9988Epoch 00032: val_acc did not improve
381/381 [==============================] - 254s - loss: 0.0756 - acc: 0.9988 - val_loss: 0.0804 - val_acc: 0.9964
Epoch 34/200
380/381 [============================>.] - ETA: 0s - loss: 0.0732 - acc: 0.9988Epoch 00033: val_acc did not improve
381/381 [==============================] - 255s - loss: 0.0732 - acc: 0.9988 - val_loss: 0.0746 - val_acc: 0.9977
Epoch 35/200
380/381 [============================>.] - ETA: 0s - loss: 0.0709 - acc: 0.9987Epoch 00034: val_acc did not improve
381/381 [==============================] - 253s - loss: 0.0708 - acc: 0.9987 - val_loss: 0.0704 - val_acc: 0.9988
Epoch 36/200
380/381 [============================>.] - ETA: 0s - loss: 0.0699 - acc: 0.9985Epoch 00035: val_acc did not improve
381/381 [==============================] - 253s - loss: 0.0699 - acc: 0.9985 - val_loss: 0.0708 - val_acc: 0.9977
Epoch 37/200
380/381 [============================>.] - ETA: 0s - loss: 0.0669 - acc: 0.9989Epoch 00036: val_acc improved from 0.99918 to 0.99951, saving model to 2017-06-02_vgg.h5
381/381 [==============================] - 254s - loss: 0.0669 - acc: 0.9989 - val_loss: 0.0645 - val_acc: 0.9995
Epoch 38/200
380/381 [============================>.] - ETA: 0s - loss: 0.0665 - acc: 0.9983Epoch 00037: val_acc did not improve
381/381 [==============================] - 252s - loss: 0.0665 - acc: 0.9983 - val_loss: 0.0900 - val_acc: 0.9933
Epoch 39/200
380/381 [============================>.] - ETA: 0s - loss: 0.0636 - acc: 0.9990Epoch 00038: val_acc did not improve
381/381 [==============================] - 252s - loss: 0.0636 - acc: 0.9990 - val_loss: 0.0630 - val_acc: 0.9987
Epoch 40/200
380/381 [============================>.] - ETA: 0s - loss: 0.0623 - acc: 0.9987Epoch 00039: val_acc did not improve
381/381 [==============================] - 252s - loss: 0.0623 - acc: 0.9987 - val_loss: 0.0694 - val_acc: 0.9967
Epoch 41/200
380/381 [============================>.] - ETA: 0s - loss: 0.0615 - acc: 0.9985Epoch 00040: val_acc did not improve
381/381 [==============================] - 254s - loss: 0.0615 - acc: 0.9985 - val_loss: 0.0642 - val_acc: 0.9977
Epoch 42/200
380/381 [============================>.] - ETA: 0s - loss: 0.0592 - acc: 0.9988Epoch 00041: val_acc did not improve
381/381 [==============================] - 259s - loss: 0.0593 - acc: 0.9988 - val_loss: 0.1173 - val_acc: 0.9819
Epoch 43/200
380/381 [============================>.] - ETA: 0s - loss: 0.0593 - acc: 0.9986Epoch 00042: val_acc did not improve
381/381 [==============================] - 259s - loss: 0.0594 - acc: 0.9986 - val_loss: 0.0858 - val_acc: 0.9900
Epoch 44/200
380/381 [============================>.] - ETA: 0s - loss: 0.0568 - acc: 0.9989Epoch 00043: val_acc did not improve
381/381 [==============================] - 259s - loss: 0.0568 - acc: 0.9989 - val_loss: 0.0557 - val_acc: 0.9992
Epoch 45/200
380/381 [============================>.] - ETA: 0s - loss: 0.0558 - acc: 0.9987Epoch 00044: val_acc did not improve
381/381 [==============================] - 259s - loss: 0.0558 - acc: 0.9987 - val_loss: 0.0597 - val_acc: 0.9977
Epoch 46/200
380/381 [============================>.] - ETA: 0s - loss: 0.0560 - acc: 0.9983Epoch 00045: val_acc did not improve

Epoch 00045: reducing learning rate to 0.25.
381/381 [==============================] - 259s - loss: 0.0560 - acc: 0.9983 - val_loss: 0.0621 - val_acc: 0.9960
Epoch 47/200
380/381 [============================>.] - ETA: 0s - loss: 0.0520 - acc: 0.9994Epoch 00046: val_acc did not improve
381/381 [==============================] - 259s - loss: 0.0520 - acc: 0.9994 - val_loss: 0.0530 - val_acc: 0.9993
Epoch 48/200
380/381 [============================>.] - ETA: 0s - loss: 0.0506 - acc: 0.9995Epoch 00047: val_acc did not improve
381/381 [==============================] - 258s - loss: 0.0506 - acc: 0.9995 - val_loss: 0.0517 - val_acc: 0.9985
Epoch 49/200
380/381 [============================>.] - ETA: 0s - loss: 0.0497 - acc: 0.9995Epoch 00048: val_acc did not improve
381/381 [==============================] - 254s - loss: 0.0497 - acc: 0.9995 - val_loss: 0.0501 - val_acc: 0.9992
Epoch 50/200
380/381 [============================>.] - ETA: 0s - loss: 0.0485 - acc: 0.9995Epoch 00049: val_acc did not improve
381/381 [==============================] - 255s - loss: 0.0485 - acc: 0.9995 - val_loss: 0.0496 - val_acc: 0.9992
Epoch 51/200
380/381 [============================>.] - ETA: 0s - loss: 0.0480 - acc: 0.9996Epoch 00050: val_acc did not improve
381/381 [==============================] - 255s - loss: 0.0480 - acc: 0.9996 - val_loss: 0.0485 - val_acc: 0.9990
Epoch 52/200
380/381 [============================>.] - ETA: 0s - loss: 0.0465 - acc: 0.9997Epoch 00051: val_acc did not improve
381/381 [==============================] - 258s - loss: 0.0464 - acc: 0.9997 - val_loss: 0.0493 - val_acc: 0.9982
Epoch 53/200
380/381 [============================>.] - ETA: 0s - loss: 0.0456 - acc: 0.9996Epoch 00052: val_acc did not improve
381/381 [==============================] - 259s - loss: 0.0456 - acc: 0.9996 - val_loss: 0.0459 - val_acc: 0.9995
Epoch 54/200
380/381 [============================>.] - ETA: 0s - loss: 0.0450 - acc: 0.9996Epoch 00053: val_acc did not improve

Epoch 00053: reducing learning rate to 0.125.
381/381 [==============================] - 259s - loss: 0.0450 - acc: 0.9996 - val_loss: 0.0463 - val_acc: 0.9992
Epoch 55/200
380/381 [============================>.] - ETA: 0s - loss: 0.0438 - acc: 0.9997Epoch 00054: val_acc did not improve
381/381 [==============================] - 259s - loss: 0.0438 - acc: 0.9997 - val_loss: 0.0451 - val_acc: 0.9995
Epoch 56/200
380/381 [============================>.] - ETA: 0s - loss: 0.0433 - acc: 0.9998Epoch 00055: val_acc did not improve
381/381 [==============================] - 258s - loss: 0.0433 - acc: 0.9998 - val_loss: 0.0443 - val_acc: 0.9995
Epoch 57/200
380/381 [============================>.] - ETA: 0s - loss: 0.0427 - acc: 0.9998Epoch 00056: val_acc did not improve
381/381 [==============================] - 258s - loss: 0.0427 - acc: 0.9998 - val_loss: 0.0447 - val_acc: 0.9995
Epoch 58/200
380/381 [============================>.] - ETA: 0s - loss: 0.0425 - acc: 0.9997Epoch 00057: val_acc did not improve
381/381 [==============================] - 259s - loss: 0.0425 - acc: 0.9997 - val_loss: 0.0437 - val_acc: 0.9992
Epoch 00057: early stopping
Loading best model from check-point and testing...
                 precision    recall  f1-score   support

      Half-Note       1.00      1.00      1.00       160
           Flat       1.00      1.00      1.00       158
       4-4-Time       1.00      1.00      1.00       160
        Barline       1.00      1.00      1.00       160
   Quarter-Note       1.00      1.00      1.00       160
       6-8-Time       1.00      1.00      1.00       160
       3-8-Time       1.00      1.00      1.00       160
       3-4-Time       1.00      1.00      1.00       160
        Natural       1.00      1.00      1.00       160
         G-Clef       1.00      1.00      1.00       160
 Sixteenth-Note       1.00      1.00      1.00       160
Thirty-Two-Rest       1.00      1.00      1.00       161
Sixty-Four-Note       0.99      1.00      0.99       160
Whole-Half-Rest       1.00      1.00      1.00       160
            Dot       1.00      1.00      1.00       320
 Sixteenth-Rest       1.00      1.00      1.00       160
   Quarter-Rest       1.00      1.00      1.00       160
       Cut-Time       1.00      1.00      1.00       159
    Common-Time       1.00      1.00      1.00       160
Thirty-Two-Note       0.99      1.00      0.99       319
         F-Clef       1.00      1.00      1.00       160
Sixty-Four-Rest       1.00      0.99      0.99       320
     Whole-Note       1.00      1.00      1.00       160
       9-8-Time       1.00      1.00      1.00       160
      12-8-Time       1.00      0.99      1.00       320
          Sharp       1.00      1.00      1.00       160
         C-Clef       1.00      1.00      1.00       319
       2-4-Time       1.00      1.00      1.00       160
   Double-Sharp       0.99      1.00      1.00       319
    Eighth-Note       1.00      1.00      1.00       160
       2-2-Time       1.00      0.99      0.99       160
    Eighth-Rest       1.00      1.00      1.00       160

    avg / total       1.00      1.00      1.00      6075

Total Loss: 0.06624
Total Accuracy: 99.86831%
Total Error: 0.13169%
Execution time: 14978.1s
