C:\Programming\Anaconda3-4.2.0\python.exe C:/Users/Alex/Repositories/MusicSymbolClassifier/HomusTrainer/TrainModel.py --delete_and_recreate_dataset_directory False --model_name vgg
Using TensorFlow backend.
Training on dataset...
Found 12170 images belonging to 32 classes.
Found 1515 images belonging to 32 classes.
Found 1515 images belonging to 32 classes.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 224, 128, 16)      448       
_________________________________________________________________
batch_normalization_1 (Batch (None, 224, 128, 16)      64        
_________________________________________________________________
activation_1 (Activation)    (None, 224, 128, 16)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 224, 128, 16)      2320      
_________________________________________________________________
batch_normalization_2 (Batch (None, 224, 128, 16)      64        
_________________________________________________________________
activation_2 (Activation)    (None, 224, 128, 16)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 112, 64, 16)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 112, 64, 32)       4640      
_________________________________________________________________
batch_normalization_3 (Batch (None, 112, 64, 32)       128       
_________________________________________________________________
activation_3 (Activation)    (None, 112, 64, 32)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 112, 64, 32)       9248      
_________________________________________________________________
batch_normalization_4 (Batch (None, 112, 64, 32)       128       
_________________________________________________________________
activation_4 (Activation)    (None, 112, 64, 32)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 56, 32, 32)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 56, 32, 64)        18496     
_________________________________________________________________
batch_normalization_5 (Batch (None, 56, 32, 64)        256       
_________________________________________________________________
activation_5 (Activation)    (None, 56, 32, 64)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 56, 32, 64)        36928     
_________________________________________________________________
batch_normalization_6 (Batch (None, 56, 32, 64)        256       
_________________________________________________________________
activation_6 (Activation)    (None, 56, 32, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 56, 32, 64)        36928     
_________________________________________________________________
batch_normalization_7 (Batch (None, 56, 32, 64)        256       
_________________________________________________________________
activation_7 (Activation)    (None, 56, 32, 64)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 28, 16, 64)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 28, 16, 128)       73856     
_________________________________________________________________
batch_normalization_8 (Batch (None, 28, 16, 128)       512       
_________________________________________________________________
activation_8 (Activation)    (None, 28, 16, 128)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 28, 16, 128)       147584    
_________________________________________________________________
batch_normalization_9 (Batch (None, 28, 16, 128)       512       
_________________________________________________________________
activation_9 (Activation)    (None, 28, 16, 128)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 28, 16, 128)       147584    
_________________________________________________________________
batch_normalization_10 (Batc (None, 28, 16, 128)       512       
_________________________________________________________________
activation_10 (Activation)   (None, 28, 16, 128)       0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 14, 8, 128)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 14, 8, 192)        221376    
_________________________________________________________________
batch_normalization_11 (Batc (None, 14, 8, 192)        768       
_________________________________________________________________
activation_11 (Activation)   (None, 14, 8, 192)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 14, 8, 192)        331968    
_________________________________________________________________
batch_normalization_12 (Batc (None, 14, 8, 192)        768       
_________________________________________________________________
activation_12 (Activation)   (None, 14, 8, 192)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 14, 8, 192)        331968    
_________________________________________________________________
batch_normalization_13 (Batc (None, 14, 8, 192)        768       
_________________________________________________________________
activation_13 (Activation)   (None, 14, 8, 192)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 14, 8, 192)        331968    
_________________________________________________________________
batch_normalization_14 (Batc (None, 14, 8, 192)        768       
_________________________________________________________________
activation_14 (Activation)   (None, 14, 8, 192)        0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 7, 4, 192)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 5376)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                172064    
_________________________________________________________________
output_node (Activation)     (None, 32)                0         
=================================================================
Total params: 1,873,136
Trainable params: 1,870,256
Non-trainable params: 2,880
_________________________________________________________________
Model vgg loaded.
2017-06-01 12:42:37.966713: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE instructions, but these are available on your machine and could speed up CPU computations.
2017-06-01 12:42:37.966939: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE2 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-01 12:42:37.967157: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE3 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-01 12:42:37.967378: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE4.1 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-01 12:42:37.967602: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE4.2 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-01 12:42:37.968156: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use AVX instructions, but these are available on your machine and could speed up CPU computations.
2017-06-01 12:42:37.968406: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use AVX2 instructions, but these are available on your machine and could speed up CPU computations.
2017-06-01 12:42:37.968642: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use FMA instructions, but these are available on your machine and could speed up CPU computations.
2017-06-01 12:42:38.291610: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:887] Found device 0 with properties: 
name: GeForce GTX 1080 Ti
major: 6 minor: 1 memoryClockRate (GHz) 1.582
pciBusID 0000:01:00.0
Total memory: 11.00GiB
Free memory: 9.12GiB
2017-06-01 12:42:38.291912: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:908] DMA: 0 
2017-06-01 12:42:38.292043: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:918] 0:   Y 
2017-06-01 12:42:38.292201: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:977] Creating TensorFlow device (/gpu:0) -> (device: 0, name: GeForce GTX 1080 Ti, pci bus id: 0000:01:00.0)
Training for 200 epochs with initial learning rate of 0.01, weight-decay of 0.0001 and Nesterov Momentum of 0.9 ...
Additional parameters: Initialization: glorot_uniform, Minibatch-size: 64, Early stopping after 20 epochs without improvement
Data-Shape: (224, 128, 3), Reducing learning rate by factor to 0.5 respectively if not improved validation accuracy after 8 epochs
Data-augmentation: Zooming 20.0% randomly, rotating 10° randomly
Optimizer: SGD, with parameters {'momentum': 0.8999999761581421, 'decay': 0.0, 'lr': 0.009999999776482582, 'nesterov': True}
Epoch 1/200
  9/191 [>.............................] - ETA: 124s - loss: 8.9901 - acc: 0.04862017-06-01 12:42:51.595930: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\pool_allocator.cc:247] PoolAllocator: After 3616 get requests, put_count=3570 evicted_count=1000 eviction_rate=0.280112 and unsatisfied allocation rate=0.316925
2017-06-01 12:42:51.596200: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
190/191 [============================>.] - ETA: 0s - loss: 5.1532 - acc: 0.1744Epoch 00000: val_acc improved from -inf to 0.02640, saving model to 2017-06-01_vgg.h5
191/191 [==============================] - 72s - loss: 5.1702 - acc: 0.1740 - val_loss: 15.8501 - val_acc: 0.0264
Epoch 2/200
190/191 [============================>.] - ETA: 0s - loss: 3.0108 - acc: 0.4859Epoch 00001: val_acc improved from 0.02640 to 0.11221, saving model to 2017-06-01_vgg.h5
191/191 [==============================] - 62s - loss: 3.0078 - acc: 0.4870 - val_loss: 9.7720 - val_acc: 0.1122
Epoch 3/200
190/191 [============================>.] - ETA: 0s - loss: 1.9933 - acc: 0.6919Epoch 00002: val_acc improved from 0.11221 to 0.63366, saving model to 2017-06-01_vgg.h5
191/191 [==============================] - 64s - loss: 1.9962 - acc: 0.6914 - val_loss: 2.1170 - val_acc: 0.6337
Epoch 4/200
190/191 [============================>.] - ETA: 0s - loss: 1.5864 - acc: 0.7596Epoch 00003: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.5791 - acc: 0.7609 - val_loss: 5.3312 - val_acc: 0.3934
Epoch 5/200
190/191 [============================>.] - ETA: 0s - loss: 1.4101 - acc: 0.8124Epoch 00004: val_acc improved from 0.63366 to 0.63960, saving model to 2017-06-01_vgg.h5
191/191 [==============================] - 63s - loss: 1.4132 - acc: 0.8124 - val_loss: 1.9928 - val_acc: 0.6396
Epoch 6/200
190/191 [============================>.] - ETA: 0s - loss: 1.3215 - acc: 0.8402Epoch 00005: val_acc improved from 0.63960 to 0.75644, saving model to 2017-06-01_vgg.h5
191/191 [==============================] - 63s - loss: 1.3212 - acc: 0.8395 - val_loss: 1.6528 - val_acc: 0.7564
Epoch 7/200
190/191 [============================>.] - ETA: 0s - loss: 1.2815 - acc: 0.8533Epoch 00006: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.2898 - acc: 0.8525 - val_loss: 2.8213 - val_acc: 0.6000
Epoch 8/200
190/191 [============================>.] - ETA: 0s - loss: 1.2415 - acc: 0.8703Epoch 00007: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.2417 - acc: 0.8694 - val_loss: 2.2069 - val_acc: 0.6660
Epoch 9/200
190/191 [============================>.] - ETA: 0s - loss: 1.2366 - acc: 0.8702Epoch 00008: val_acc improved from 0.75644 to 0.85545, saving model to 2017-06-01_vgg.h5
191/191 [==============================] - 63s - loss: 1.2479 - acc: 0.8699 - val_loss: 1.3270 - val_acc: 0.8554
Epoch 10/200
190/191 [============================>.] - ETA: 0s - loss: 1.1871 - acc: 0.8856Epoch 00009: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.1902 - acc: 0.8857 - val_loss: 1.4798 - val_acc: 0.7987
Epoch 11/200
190/191 [============================>.] - ETA: 0s - loss: 1.1670 - acc: 0.8906Epoch 00010: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.1786 - acc: 0.8902 - val_loss: 1.3674 - val_acc: 0.8198
Epoch 12/200
190/191 [============================>.] - ETA: 0s - loss: 1.1457 - acc: 0.9002Epoch 00011: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.1417 - acc: 0.9002 - val_loss: 1.3152 - val_acc: 0.8488
Epoch 13/200
190/191 [============================>.] - ETA: 0s - loss: 1.1554 - acc: 0.8965Epoch 00012: val_acc improved from 0.85545 to 0.88713, saving model to 2017-06-01_vgg.h5
191/191 [==============================] - 63s - loss: 1.1513 - acc: 0.8965 - val_loss: 1.1947 - val_acc: 0.8871
Epoch 14/200
190/191 [============================>.] - ETA: 0s - loss: 1.1264 - acc: 0.9046Epoch 00013: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.1308 - acc: 0.9041 - val_loss: 1.3372 - val_acc: 0.8548
Epoch 15/200
190/191 [============================>.] - ETA: 0s - loss: 1.1259 - acc: 0.9044Epoch 00014: val_acc improved from 0.88713 to 0.89373, saving model to 2017-06-01_vgg.h5
191/191 [==============================] - 63s - loss: 1.1380 - acc: 0.9039 - val_loss: 1.1147 - val_acc: 0.8937
Epoch 16/200
190/191 [============================>.] - ETA: 0s - loss: 1.1177 - acc: 0.9081Epoch 00015: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.1127 - acc: 0.9085 - val_loss: 1.2214 - val_acc: 0.8766
Epoch 17/200
190/191 [============================>.] - ETA: 0s - loss: 1.1136 - acc: 0.9074Epoch 00016: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.1090 - acc: 0.9079 - val_loss: 1.2840 - val_acc: 0.8759
Epoch 18/200
190/191 [============================>.] - ETA: 0s - loss: 1.1092 - acc: 0.9116Epoch 00017: val_acc improved from 0.89373 to 0.89703, saving model to 2017-06-01_vgg.h5
191/191 [==============================] - 64s - loss: 1.1042 - acc: 0.9121 - val_loss: 1.1216 - val_acc: 0.8970
Epoch 19/200
190/191 [============================>.] - ETA: 0s - loss: 1.0868 - acc: 0.9196Epoch 00018: val_acc did not improve
191/191 [==============================] - 65s - loss: 1.0820 - acc: 0.9200 - val_loss: 1.2336 - val_acc: 0.8911
Epoch 20/200
190/191 [============================>.] - ETA: 0s - loss: 1.0904 - acc: 0.9164Epoch 00019: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0864 - acc: 0.9163 - val_loss: 1.2484 - val_acc: 0.8614
Epoch 21/200
190/191 [============================>.] - ETA: 0s - loss: 1.0940 - acc: 0.9160Epoch 00020: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0975 - acc: 0.9160 - val_loss: 1.3715 - val_acc: 0.8521
Epoch 22/200
190/191 [============================>.] - ETA: 0s - loss: 1.0710 - acc: 0.9241Epoch 00021: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0750 - acc: 0.9240 - val_loss: 1.6655 - val_acc: 0.7452
Epoch 23/200
190/191 [============================>.] - ETA: 0s - loss: 1.0796 - acc: 0.9209Epoch 00022: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0832 - acc: 0.9208 - val_loss: 1.3271 - val_acc: 0.8488
Epoch 24/200
190/191 [============================>.] - ETA: 0s - loss: 1.0697 - acc: 0.9234Epoch 00023: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0774 - acc: 0.9228 - val_loss: 1.3774 - val_acc: 0.8323
Epoch 25/200
190/191 [============================>.] - ETA: 0s - loss: 1.0732 - acc: 0.9213Epoch 00024: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0789 - acc: 0.9207 - val_loss: 1.1882 - val_acc: 0.8904
Epoch 26/200
190/191 [============================>.] - ETA: 0s - loss: 1.0763 - acc: 0.9206Epoch 00025: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0799 - acc: 0.9205 - val_loss: 1.2832 - val_acc: 0.8686
Epoch 27/200
190/191 [============================>.] - ETA: 0s - loss: 1.0628 - acc: 0.9239Epoch 00026: val_acc did not improve

Epoch 00026: reducing learning rate to 0.004999999888241291.
191/191 [==============================] - 64s - loss: 1.0665 - acc: 0.9238 - val_loss: 1.1829 - val_acc: 0.8845
Epoch 28/200
190/191 [============================>.] - ETA: 0s - loss: 1.0428 - acc: 0.9324Epoch 00027: val_acc improved from 0.89703 to 0.92211, saving model to 2017-06-01_vgg.h5
191/191 [==============================] - 63s - loss: 1.0381 - acc: 0.9328 - val_loss: 1.0575 - val_acc: 0.9221
Epoch 29/200
190/191 [============================>.] - ETA: 0s - loss: 1.0271 - acc: 0.9377Epoch 00028: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.0309 - acc: 0.9375 - val_loss: 1.0918 - val_acc: 0.9162
Epoch 30/200
190/191 [============================>.] - ETA: 0s - loss: 1.0258 - acc: 0.9387Epoch 00029: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0213 - acc: 0.9390 - val_loss: 1.1338 - val_acc: 0.9109
Epoch 31/200
190/191 [============================>.] - ETA: 0s - loss: 1.0261 - acc: 0.9385Epoch 00030: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.0215 - acc: 0.9388 - val_loss: 1.1419 - val_acc: 0.9175
Epoch 32/200
190/191 [============================>.] - ETA: 0s - loss: 1.0218 - acc: 0.9389Epoch 00031: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0257 - acc: 0.9387 - val_loss: 1.0470 - val_acc: 0.9122
Epoch 33/200
190/191 [============================>.] - ETA: 0s - loss: 1.0197 - acc: 0.9400Epoch 00032: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0151 - acc: 0.9403 - val_loss: 1.0877 - val_acc: 0.9149
Epoch 34/200
190/191 [============================>.] - ETA: 0s - loss: 1.0211 - acc: 0.9388Epoch 00033: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0252 - acc: 0.9386 - val_loss: 1.1690 - val_acc: 0.9043
Epoch 35/200
190/191 [============================>.] - ETA: 0s - loss: 1.0192 - acc: 0.9400Epoch 00034: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0147 - acc: 0.9403 - val_loss: 1.1118 - val_acc: 0.9116
Epoch 36/200
190/191 [============================>.] - ETA: 0s - loss: 1.0150 - acc: 0.9404Epoch 00035: val_acc did not improve
191/191 [==============================] - 72s - loss: 1.0192 - acc: 0.9402 - val_loss: 1.1255 - val_acc: 0.9076
Epoch 37/200
190/191 [============================>.] - ETA: 0s - loss: 1.0168 - acc: 0.9403Epoch 00036: val_acc did not improve

Epoch 00036: reducing learning rate to 0.0024999999441206455.
191/191 [==============================] - 64s - loss: 1.0123 - acc: 0.9406 - val_loss: 1.1401 - val_acc: 0.9149
Epoch 38/200
190/191 [============================>.] - ETA: 0s - loss: 1.0106 - acc: 0.9423Epoch 00037: val_acc improved from 0.92211 to 0.92475, saving model to 2017-06-01_vgg.h5
191/191 [==============================] - 64s - loss: 1.0065 - acc: 0.9420 - val_loss: 1.0734 - val_acc: 0.9248
Epoch 39/200
190/191 [============================>.] - ETA: 0s - loss: 1.0087 - acc: 0.9428Epoch 00038: val_acc did not improve
191/191 [==============================] - 65s - loss: 1.0042 - acc: 0.9431 - val_loss: 1.1657 - val_acc: 0.9195
Epoch 40/200
190/191 [============================>.] - ETA: 0s - loss: 1.0075 - acc: 0.9435Epoch 00039: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0115 - acc: 0.9433 - val_loss: 1.1314 - val_acc: 0.9188
Epoch 41/200
190/191 [============================>.] - ETA: 0s - loss: 1.0067 - acc: 0.9437Epoch 00040: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.0107 - acc: 0.9434 - val_loss: 1.1299 - val_acc: 0.9228
Epoch 42/200
190/191 [============================>.] - ETA: 0s - loss: 1.0044 - acc: 0.9438Epoch 00041: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.0083 - acc: 0.9436 - val_loss: 1.0726 - val_acc: 0.9241
Epoch 43/200
190/191 [============================>.] - ETA: 0s - loss: 1.0051 - acc: 0.9438Epoch 00042: val_acc improved from 0.92475 to 0.93267, saving model to 2017-06-01_vgg.h5
191/191 [==============================] - 64s - loss: 1.0006 - acc: 0.9441 - val_loss: 1.0107 - val_acc: 0.9327
Epoch 44/200
190/191 [============================>.] - ETA: 0s - loss: 1.0056 - acc: 0.9433Epoch 00043: val_acc did not improve
191/191 [==============================] - 65s - loss: 1.0095 - acc: 0.9431 - val_loss: 1.0625 - val_acc: 0.9241
Epoch 45/200
190/191 [============================>.] - ETA: 0s - loss: 1.0063 - acc: 0.9435Epoch 00044: val_acc did not improve
191/191 [==============================] - 66s - loss: 1.0020 - acc: 0.9438 - val_loss: 1.0847 - val_acc: 0.9274
Epoch 46/200
190/191 [============================>.] - ETA: 0s - loss: 1.0021 - acc: 0.9438Epoch 00045: val_acc did not improve
191/191 [==============================] - 63s - loss: 1.0144 - acc: 0.9431 - val_loss: 1.0795 - val_acc: 0.9241
Epoch 47/200
190/191 [============================>.] - ETA: 0s - loss: 1.0028 - acc: 0.9444Epoch 00046: val_acc did not improve
191/191 [==============================] - 64s - loss: 1.0067 - acc: 0.9442 - val_loss: 1.0792 - val_acc: 0.9267
Epoch 48/200
190/191 [============================>.] - ETA: 0s - loss: 1.0029 - acc: 0.9439Epoch 00047: val_acc did not improve
191/191 [==============================] - 67s - loss: 1.0068 - acc: 0.9437 - val_loss: 1.0845 - val_acc: 0.9241
Epoch 49/200
190/191 [============================>.] - ETA: 0s - loss: 1.0013 - acc: 0.9441Epoch 00048: val_acc did not improve
191/191 [==============================] - 66s - loss: 1.0054 - acc: 0.9438 - val_loss: 1.1039 - val_acc: 0.9201
Epoch 50/200
190/191 [============================>.] - ETA: 0s - loss: 1.0004 - acc: 0.9447Epoch 00049: val_acc did not improve
191/191 [==============================] - 66s - loss: 1.0048 - acc: 0.9444 - val_loss: 0.9675 - val_acc: 0.9300
Epoch 51/200
190/191 [============================>.] - ETA: 0s - loss: 1.0031 - acc: 0.9433Epoch 00050: val_acc did not improve
191/191 [==============================] - 65s - loss: 1.0070 - acc: 0.9431 - val_loss: 1.0286 - val_acc: 0.9267
Epoch 52/200
190/191 [============================>.] - ETA: 0s - loss: 1.0012 - acc: 0.9447Epoch 00051: val_acc did not improve

Epoch 00051: reducing learning rate to 0.0012499999720603228.
191/191 [==============================] - 63s - loss: 1.0055 - acc: 0.9444 - val_loss: 1.0117 - val_acc: 0.9294
Epoch 53/200
190/191 [============================>.] - ETA: 0s - loss: 1.0014 - acc: 0.9445Epoch 00052: val_acc did not improve
191/191 [==============================] - 65s - loss: 1.0059 - acc: 0.9437 - val_loss: 1.0866 - val_acc: 0.9274
Epoch 54/200
190/191 [============================>.] - ETA: 0s - loss: 1.0006 - acc: 0.9447Epoch 00053: val_acc did not improve
191/191 [==============================] - 65s - loss: 0.9962 - acc: 0.9450 - val_loss: 1.0702 - val_acc: 0.9241
Epoch 55/200
190/191 [============================>.] - ETA: 0s - loss: 0.9984 - acc: 0.9451Epoch 00054: val_acc did not improve
191/191 [==============================] - 65s - loss: 1.0023 - acc: 0.9449 - val_loss: 1.0577 - val_acc: 0.9281
Epoch 56/200
190/191 [============================>.] - ETA: 0s - loss: 0.9985 - acc: 0.9456Epoch 00055: val_acc did not improve
191/191 [==============================] - 65s - loss: 0.9942 - acc: 0.9459 - val_loss: 1.1079 - val_acc: 0.9188
Epoch 57/200
190/191 [============================>.] - ETA: 0s - loss: 0.9994 - acc: 0.9450Epoch 00056: val_acc did not improve
191/191 [==============================] - 66s - loss: 0.9949 - acc: 0.9453 - val_loss: 1.0297 - val_acc: 0.9314
Epoch 58/200
190/191 [============================>.] - ETA: 0s - loss: 0.9990 - acc: 0.9448Epoch 00057: val_acc did not improve
191/191 [==============================] - 65s - loss: 0.9946 - acc: 0.9451 - val_loss: 1.0588 - val_acc: 0.9274
Epoch 59/200
190/191 [============================>.] - ETA: 0s - loss: 0.9978 - acc: 0.9456Epoch 00058: val_acc did not improve
191/191 [==============================] - 67s - loss: 1.0018 - acc: 0.9453 - val_loss: 1.1370 - val_acc: 0.9221
Epoch 60/200
190/191 [============================>.] - ETA: 0s - loss: 0.9976 - acc: 0.9449Epoch 00059: val_acc did not improve

Epoch 00059: reducing learning rate to 0.0006249999860301614.
191/191 [==============================] - 66s - loss: 1.0015 - acc: 0.9447 - val_loss: 1.0628 - val_acc: 0.9234
Epoch 61/200
190/191 [============================>.] - ETA: 0s - loss: 0.9975 - acc: 0.9453Epoch 00060: val_acc did not improve
191/191 [==============================] - 65s - loss: 0.9930 - acc: 0.9456 - val_loss: 1.0346 - val_acc: 0.9228
Epoch 62/200
190/191 [============================>.] - ETA: 0s - loss: 0.9997 - acc: 0.9450Epoch 00061: val_acc did not improve
191/191 [==============================] - 64s - loss: 0.9955 - acc: 0.9453 - val_loss: 1.0164 - val_acc: 0.9281
Epoch 63/200
190/191 [============================>.] - ETA: 0s - loss: 0.9963 - acc: 0.9459Epoch 00062: val_acc did not improve
191/191 [==============================] - 64s - loss: 0.9919 - acc: 0.9462 - val_loss: 1.0761 - val_acc: 0.9267
Epoch 64/200
190/191 [============================>.] - ETA: 0s - loss: 0.9980 - acc: 0.9451Epoch 00063: val_acc did not improve
191/191 [==============================] - 64s - loss: 0.9935 - acc: 0.9454 - val_loss: 1.0302 - val_acc: 0.9294
Epoch 00063: early stopping
Loading best model from check-point and testing...
C:\Programming\Anaconda3-4.2.0\lib\site-packages\sklearn\metrics\classification.py:1113: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples.
  'precision', 'predicted', average, warn_for)
                 precision    recall  f1-score   support

      12-8-Time       1.00      1.00      1.00        40
       2-2-Time       1.00      1.00      1.00        39
       2-4-Time       0.95      0.97      0.96        40
       3-4-Time       1.00      0.93      0.96        40
       3-8-Time       1.00      1.00      1.00        40
       4-4-Time       1.00      1.00      1.00        40
       6-8-Time       1.00      1.00      1.00        40
       9-8-Time       1.00      1.00      1.00        40
        Barline       0.98      1.00      0.99        40
         C-Clef       1.00      1.00      1.00        40
    Common-Time       1.00      1.00      1.00        40
       Cut-Time       0.98      1.00      0.99        40
            Dot       0.97      0.97      0.97        40
   Double-Sharp       0.98      1.00      0.99        40
    Eighth-Note       0.97      0.96      0.97        80
    Eighth-Rest       1.00      0.95      0.97        40
         F-Clef       1.00      1.00      1.00        40
           Flat       0.95      1.00      0.97        39
         G-Clef       1.00      1.00      1.00        40
      Half-Note       1.00      0.99      0.99        79
        Natural       1.00      0.95      0.97        40
   Quarter-Note       0.99      1.00      0.99        80
   Quarter-Rest       0.90      0.90      0.90        40
          Sharp       0.97      0.97      0.97        40
 Sixteenth-Note       0.91      0.94      0.93        80
 Sixteenth-Rest       0.97      0.95      0.96        40
Sixty-Four-Note       0.00      0.00      0.00        79
Sixty-Four-Rest       1.00      0.93      0.96        40
Thirty-Two-Note       0.48      0.95      0.64        79
Thirty-Two-Rest       0.89      1.00      0.94        40
Whole-Half-Rest       0.97      0.97      0.97        40
     Whole-Note       1.00      1.00      1.00        40

    avg / total       0.90      0.93      0.91      1515

Total Loss: 1.07153
Total Accuracy: 92.60726%
Total Error: 7.39274%
Execution time: 4165.7s
