C:\Programming\Anaconda3-4.2.0\python.exe C:/Users/Alex/Repositories/MusicSymbolClassifier/ModelGenerator/TrainModel.py --delete_and_recreate_dataset_directory False --model_name vgg4
Using TensorFlow backend.
Training on dataset...
Found 12170 images belonging to 32 classes.
Found 1515 images belonging to 32 classes.
Found 1515 images belonging to 32 classes.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 244, 128, 32)      896       
_________________________________________________________________
batch_normalization_1 (Batch (None, 244, 128, 32)      128       
_________________________________________________________________
activation_1 (Activation)    (None, 244, 128, 32)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 244, 128, 32)      9248      
_________________________________________________________________
batch_normalization_2 (Batch (None, 244, 128, 32)      128       
_________________________________________________________________
activation_2 (Activation)    (None, 244, 128, 32)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 122, 64, 32)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 122, 64, 64)       18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 122, 64, 64)       256       
_________________________________________________________________
activation_3 (Activation)    (None, 122, 64, 64)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 122, 64, 64)       36928     
_________________________________________________________________
batch_normalization_4 (Batch (None, 122, 64, 64)       256       
_________________________________________________________________
activation_4 (Activation)    (None, 122, 64, 64)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 61, 32, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 61, 32, 128)       73856     
_________________________________________________________________
batch_normalization_5 (Batch (None, 61, 32, 128)       512       
_________________________________________________________________
activation_5 (Activation)    (None, 61, 32, 128)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 61, 32, 128)       147584    
_________________________________________________________________
batch_normalization_6 (Batch (None, 61, 32, 128)       512       
_________________________________________________________________
activation_6 (Activation)    (None, 61, 32, 128)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 61, 32, 128)       147584    
_________________________________________________________________
batch_normalization_7 (Batch (None, 61, 32, 128)       512       
_________________________________________________________________
activation_7 (Activation)    (None, 61, 32, 128)       0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 30, 16, 128)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 30, 16, 256)       295168    
_________________________________________________________________
batch_normalization_8 (Batch (None, 30, 16, 256)       1024      
_________________________________________________________________
activation_8 (Activation)    (None, 30, 16, 256)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 30, 16, 256)       590080    
_________________________________________________________________
batch_normalization_9 (Batch (None, 30, 16, 256)       1024      
_________________________________________________________________
activation_9 (Activation)    (None, 30, 16, 256)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 30, 16, 256)       590080    
_________________________________________________________________
batch_normalization_10 (Batc (None, 30, 16, 256)       1024      
_________________________________________________________________
activation_10 (Activation)   (None, 30, 16, 256)       0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 15, 8, 256)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 15, 8, 512)        1180160   
_________________________________________________________________
batch_normalization_11 (Batc (None, 15, 8, 512)        2048      
_________________________________________________________________
activation_11 (Activation)   (None, 15, 8, 512)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 15, 8, 512)        2359808   
_________________________________________________________________
batch_normalization_12 (Batc (None, 15, 8, 512)        2048      
_________________________________________________________________
activation_12 (Activation)   (None, 15, 8, 512)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 15, 8, 512)        2359808   
_________________________________________________________________
batch_normalization_13 (Batc (None, 15, 8, 512)        2048      
_________________________________________________________________
activation_13 (Activation)   (None, 15, 8, 512)        0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 7, 4, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 14336)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                458784    
_________________________________________________________________
output_node (Activation)     (None, 32)                0         
=================================================================
Total params: 8,280,000
Trainable params: 8,274,240
Non-trainable params: 5,760
_________________________________________________________________
Model vgg4 loaded.
2017-05-28 09:54:32.199242: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE instructions, but these are available on your machine and could speed up CPU computations.
2017-05-28 09:54:32.199499: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE2 instructions, but these are available on your machine and could speed up CPU computations.
2017-05-28 09:54:32.199718: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE3 instructions, but these are available on your machine and could speed up CPU computations.
2017-05-28 09:54:32.199961: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE4.1 instructions, but these are available on your machine and could speed up CPU computations.
2017-05-28 09:54:32.200179: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE4.2 instructions, but these are available on your machine and could speed up CPU computations.
2017-05-28 09:54:32.200401: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use AVX instructions, but these are available on your machine and could speed up CPU computations.
2017-05-28 09:54:32.200619: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use AVX2 instructions, but these are available on your machine and could speed up CPU computations.
2017-05-28 09:54:32.201466: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use FMA instructions, but these are available on your machine and could speed up CPU computations.
2017-05-28 09:54:32.525399: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:887] Found device 0 with properties: 
name: GeForce GTX 1080 Ti
major: 6 minor: 1 memoryClockRate (GHz) 1.582
pciBusID 0000:01:00.0
Total memory: 11.00GiB
Free memory: 9.12GiB
2017-05-28 09:54:32.525680: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:908] DMA: 0 
2017-05-28 09:54:32.525812: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:918] 0:   Y 
2017-05-28 09:54:32.526163: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:977] Creating TensorFlow device (/gpu:0) -> (device: 0, name: GeForce GTX 1080 Ti, pci bus id: 0000:01:00.0)
Training for 200 epochs with initial learning rate of 0.01, weight-decay of 0.0002 and Nesterov Momentum of 0.9 ...
Additional parameters: Initialization: glorot_uniform, Minibatch-size: 64, Early stopping after 20 epochs without improvement
Data-Shape: (244, 128, 3), Reducing learning rate by factor to 0.5 respectively if not improved validation accuracy after 8 epochs
Data-augmentation: Zooming 20.0% randomly, rotating 10° randomly
Optimizer: <keras.optimizers.Adam object at 0x00000187ED0DDC18>, with parameters {'lr': 0.0010000000474974513, 'beta_2': 0.9990000128746033, 'decay': 0.0, 'epsilon': 1e-08, 'beta_1': 0.8999999761581421}
Epoch 1/200
 10/191 [>.............................] - ETA: 158s - loss: 8.3529 - acc: 0.08442017-05-28 09:54:48.944615: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\pool_allocator.cc:247] PoolAllocator: After 3729 get requests, put_count=3726 evicted_count=1000 eviction_rate=0.268384 and unsatisfied allocation rate=0.29579
2017-05-28 09:54:48.944895: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
190/191 [============================>.] - ETA: 0s - loss: 3.3657 - acc: 0.3338Epoch 00000: val_acc improved from -inf to 0.04224, saving model to vgg4.h5
191/191 [==============================] - 82s - loss: 3.3605 - acc: 0.3352 - val_loss: 15.9701 - val_acc: 0.0422
Epoch 2/200
190/191 [============================>.] - ETA: 0s - loss: 1.6062 - acc: 0.6796Epoch 00001: val_acc improved from 0.04224 to 0.15314, saving model to vgg4.h5
191/191 [==============================] - 74s - loss: 1.6052 - acc: 0.6797 - val_loss: 9.8460 - val_acc: 0.1531
Epoch 3/200
190/191 [============================>.] - ETA: 0s - loss: 1.2653 - acc: 0.7603Epoch 00002: val_acc did not improve
191/191 [==============================] - 73s - loss: 1.2631 - acc: 0.7610 - val_loss: 7.4049 - val_acc: 0.1347
Epoch 4/200
190/191 [============================>.] - ETA: 0s - loss: 0.9994 - acc: 0.8091Epoch 00003: val_acc improved from 0.15314 to 0.46271, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.9998 - acc: 0.8086 - val_loss: 2.6834 - val_acc: 0.4627
Epoch 5/200
190/191 [============================>.] - ETA: 0s - loss: 0.8713 - acc: 0.8355Epoch 00004: val_acc improved from 0.46271 to 0.61254, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.8692 - acc: 0.8359 - val_loss: 1.9138 - val_acc: 0.6125
Epoch 6/200
190/191 [============================>.] - ETA: 0s - loss: 0.7270 - acc: 0.8591Epoch 00005: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.7284 - acc: 0.8593 - val_loss: 8.2114 - val_acc: 0.1512
Epoch 7/200
190/191 [============================>.] - ETA: 0s - loss: 0.6728 - acc: 0.8647Epoch 00006: val_acc improved from 0.61254 to 0.79802, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.6742 - acc: 0.8644 - val_loss: 0.8459 - val_acc: 0.7980
Epoch 8/200
190/191 [============================>.] - ETA: 0s - loss: 0.6174 - acc: 0.8765Epoch 00007: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.6182 - acc: 0.8761 - val_loss: 11.1521 - val_acc: 0.0818
Epoch 9/200
190/191 [============================>.] - ETA: 0s - loss: 0.5800 - acc: 0.8848Epoch 00008: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.5799 - acc: 0.8843 - val_loss: 1.2328 - val_acc: 0.6653
Epoch 10/200
190/191 [============================>.] - ETA: 0s - loss: 0.5640 - acc: 0.8863Epoch 00009: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.5638 - acc: 0.8858 - val_loss: 6.6567 - val_acc: 0.2079
Epoch 11/200
190/191 [============================>.] - ETA: 0s - loss: 0.5240 - acc: 0.8981Epoch 00010: val_acc improved from 0.79802 to 0.88053, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.5251 - acc: 0.8976 - val_loss: 0.6159 - val_acc: 0.8805
Epoch 12/200
190/191 [============================>.] - ETA: 0s - loss: 0.5092 - acc: 0.8999Epoch 00011: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.5082 - acc: 0.9004 - val_loss: 2.4873 - val_acc: 0.4686
Epoch 13/200
190/191 [============================>.] - ETA: 0s - loss: 0.5015 - acc: 0.9032Epoch 00012: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.5033 - acc: 0.9027 - val_loss: 1.0160 - val_acc: 0.7399
Epoch 14/200
190/191 [============================>.] - ETA: 0s - loss: 0.4859 - acc: 0.9063Epoch 00013: val_acc improved from 0.88053 to 0.90759, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.4867 - acc: 0.9063 - val_loss: 0.4808 - val_acc: 0.9076
Epoch 15/200
190/191 [============================>.] - ETA: 0s - loss: 0.4602 - acc: 0.9123Epoch 00014: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.4602 - acc: 0.9122 - val_loss: 0.5975 - val_acc: 0.8779
Epoch 16/200
190/191 [============================>.] - ETA: 0s - loss: 0.4767 - acc: 0.9072Epoch 00015: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.4764 - acc: 0.9072 - val_loss: 10.2472 - val_acc: 0.1023
Epoch 17/200
190/191 [============================>.] - ETA: 0s - loss: 0.4715 - acc: 0.9121Epoch 00016: val_acc improved from 0.90759 to 0.91749, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.4703 - acc: 0.9125 - val_loss: 0.4782 - val_acc: 0.9175
Epoch 18/200
190/191 [============================>.] - ETA: 0s - loss: 0.4586 - acc: 0.9119Epoch 00017: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.4575 - acc: 0.9124 - val_loss: 1.4628 - val_acc: 0.6726
Epoch 19/200
190/191 [============================>.] - ETA: 0s - loss: 0.4263 - acc: 0.9213Epoch 00018: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.4263 - acc: 0.9212 - val_loss: 4.6794 - val_acc: 0.3789
Epoch 20/200
190/191 [============================>.] - ETA: 0s - loss: 0.4266 - acc: 0.9213Epoch 00019: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.4281 - acc: 0.9201 - val_loss: 5.7210 - val_acc: 0.3683
Epoch 21/200
190/191 [============================>.] - ETA: 0s - loss: 0.4458 - acc: 0.9229Epoch 00020: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.4446 - acc: 0.9233 - val_loss: 8.1384 - val_acc: 0.1406
Epoch 22/200
190/191 [============================>.] - ETA: 0s - loss: 0.4069 - acc: 0.9293Epoch 00021: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.4070 - acc: 0.9291 - val_loss: 0.6622 - val_acc: 0.8495
Epoch 23/200
190/191 [============================>.] - ETA: 0s - loss: 0.4308 - acc: 0.9240Epoch 00022: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.4302 - acc: 0.9244 - val_loss: 3.6472 - val_acc: 0.5261
Epoch 24/200
190/191 [============================>.] - ETA: 0s - loss: 0.4206 - acc: 0.9255Epoch 00023: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.4201 - acc: 0.9254 - val_loss: 0.9696 - val_acc: 0.7644
Epoch 25/200
190/191 [============================>.] - ETA: 0s - loss: 0.4129 - acc: 0.9262Epoch 00024: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.4121 - acc: 0.9265 - val_loss: 1.6361 - val_acc: 0.6739
Epoch 26/200
190/191 [============================>.] - ETA: 0s - loss: 0.3986 - acc: 0.9294Epoch 00025: val_acc did not improve

Epoch 00025: reducing learning rate to 0.0005000000237487257.
191/191 [==============================] - 74s - loss: 0.4029 - acc: 0.9282 - val_loss: 0.8952 - val_acc: 0.7736
Epoch 27/200
190/191 [============================>.] - ETA: 0s - loss: 0.3362 - acc: 0.9507Epoch 00026: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.3363 - acc: 0.9505 - val_loss: 0.6427 - val_acc: 0.8475
Epoch 28/200
190/191 [============================>.] - ETA: 0s - loss: 0.2966 - acc: 0.9573Epoch 00027: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2963 - acc: 0.9575 - val_loss: 4.8868 - val_acc: 0.3215
Epoch 29/200
190/191 [============================>.] - ETA: 0s - loss: 0.2829 - acc: 0.9556Epoch 00028: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2845 - acc: 0.9553 - val_loss: 0.4138 - val_acc: 0.9168
Epoch 30/200
190/191 [============================>.] - ETA: 0s - loss: 0.2801 - acc: 0.9553Epoch 00029: val_acc improved from 0.91749 to 0.94059, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.2809 - acc: 0.9545 - val_loss: 0.3416 - val_acc: 0.9406
Epoch 31/200
190/191 [============================>.] - ETA: 0s - loss: 0.2784 - acc: 0.9558Epoch 00030: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2783 - acc: 0.9555 - val_loss: 0.5294 - val_acc: 0.8561
Epoch 32/200
190/191 [============================>.] - ETA: 0s - loss: 0.2740 - acc: 0.9563Epoch 00031: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2737 - acc: 0.9565 - val_loss: 0.6149 - val_acc: 0.8792
Epoch 33/200
190/191 [============================>.] - ETA: 0s - loss: 0.2782 - acc: 0.9512Epoch 00032: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2817 - acc: 0.9498 - val_loss: 1.7287 - val_acc: 0.5974
Epoch 34/200
190/191 [============================>.] - ETA: 0s - loss: 0.2942 - acc: 0.9510Epoch 00033: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2943 - acc: 0.9507 - val_loss: 1.2578 - val_acc: 0.7182
Epoch 35/200
190/191 [============================>.] - ETA: 0s - loss: 0.2710 - acc: 0.9581Epoch 00034: val_acc improved from 0.94059 to 0.94455, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.2732 - acc: 0.9572 - val_loss: 0.3638 - val_acc: 0.9446
Epoch 36/200
190/191 [============================>.] - ETA: 0s - loss: 0.2720 - acc: 0.9560Epoch 00035: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2716 - acc: 0.9562 - val_loss: 0.6989 - val_acc: 0.8713
Epoch 37/200
190/191 [============================>.] - ETA: 0s - loss: 0.2486 - acc: 0.9622Epoch 00036: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2481 - acc: 0.9624 - val_loss: 1.0051 - val_acc: 0.7538
Epoch 38/200
190/191 [============================>.] - ETA: 0s - loss: 0.2529 - acc: 0.9613Epoch 00037: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2537 - acc: 0.9604 - val_loss: 0.4833 - val_acc: 0.8792
Epoch 39/200
190/191 [============================>.] - ETA: 0s - loss: 0.2603 - acc: 0.9586Epoch 00038: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2634 - acc: 0.9578 - val_loss: 0.4320 - val_acc: 0.9182
Epoch 40/200
190/191 [============================>.] - ETA: 0s - loss: 0.2713 - acc: 0.9554Epoch 00039: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2714 - acc: 0.9551 - val_loss: 0.3435 - val_acc: 0.9426
Epoch 41/200
190/191 [============================>.] - ETA: 0s - loss: 0.2528 - acc: 0.9603Epoch 00040: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2527 - acc: 0.9605 - val_loss: 0.5917 - val_acc: 0.8607
Epoch 42/200
190/191 [============================>.] - ETA: 0s - loss: 0.2426 - acc: 0.9619Epoch 00041: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2434 - acc: 0.9616 - val_loss: 1.0610 - val_acc: 0.7393
Epoch 43/200
190/191 [============================>.] - ETA: 0s - loss: 0.2401 - acc: 0.9624Epoch 00042: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2397 - acc: 0.9626 - val_loss: 0.3554 - val_acc: 0.9333
Epoch 44/200
190/191 [============================>.] - ETA: 0s - loss: 0.2255 - acc: 0.9655Epoch 00043: val_acc did not improve

Epoch 00043: reducing learning rate to 0.0002500000118743628.
191/191 [==============================] - 71s - loss: 0.2255 - acc: 0.9656 - val_loss: 0.4713 - val_acc: 0.9030
Epoch 45/200
190/191 [============================>.] - ETA: 0s - loss: 0.1855 - acc: 0.9802Epoch 00044: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1857 - acc: 0.9803 - val_loss: 0.3100 - val_acc: 0.9406
Epoch 46/200
190/191 [============================>.] - ETA: 0s - loss: 0.1783 - acc: 0.9789Epoch 00045: val_acc improved from 0.94455 to 0.95710, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.1781 - acc: 0.9790 - val_loss: 0.2573 - val_acc: 0.9571
Epoch 47/200
190/191 [============================>.] - ETA: 0s - loss: 0.1774 - acc: 0.9778Epoch 00046: val_acc improved from 0.95710 to 0.96832, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.1797 - acc: 0.9769 - val_loss: 0.2301 - val_acc: 0.9683
Epoch 48/200
190/191 [============================>.] - ETA: 0s - loss: 0.1717 - acc: 0.9789Epoch 00047: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1718 - acc: 0.9791 - val_loss: 0.2557 - val_acc: 0.9525
Epoch 49/200
190/191 [============================>.] - ETA: 0s - loss: 0.1688 - acc: 0.9795Epoch 00048: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1685 - acc: 0.9796 - val_loss: 0.3594 - val_acc: 0.9314
Epoch 50/200
190/191 [============================>.] - ETA: 0s - loss: 0.1657 - acc: 0.9794Epoch 00049: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1660 - acc: 0.9790 - val_loss: 0.3157 - val_acc: 0.9393
Epoch 51/200
190/191 [============================>.] - ETA: 0s - loss: 0.1600 - acc: 0.9807Epoch 00050: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1597 - acc: 0.9808 - val_loss: 0.2383 - val_acc: 0.9591
Epoch 52/200
190/191 [============================>.] - ETA: 0s - loss: 0.1618 - acc: 0.9794Epoch 00051: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1616 - acc: 0.9795 - val_loss: 0.3141 - val_acc: 0.9360
Epoch 53/200
190/191 [============================>.] - ETA: 0s - loss: 0.1548 - acc: 0.9813Epoch 00052: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1566 - acc: 0.9809 - val_loss: 0.2990 - val_acc: 0.9413
Epoch 54/200
190/191 [============================>.] - ETA: 0s - loss: 0.1553 - acc: 0.9806Epoch 00053: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1562 - acc: 0.9797 - val_loss: 0.4536 - val_acc: 0.8884
Epoch 55/200
190/191 [============================>.] - ETA: 0s - loss: 0.1499 - acc: 0.9830Epoch 00054: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1497 - acc: 0.9831 - val_loss: 0.2033 - val_acc: 0.9657
Epoch 56/200
190/191 [============================>.] - ETA: 0s - loss: 0.1475 - acc: 0.9806Epoch 00055: val_acc did not improve

Epoch 00055: reducing learning rate to 0.0001250000059371814.
191/191 [==============================] - 71s - loss: 0.1473 - acc: 0.9807 - val_loss: 0.2686 - val_acc: 0.9446
Epoch 57/200
190/191 [============================>.] - ETA: 0s - loss: 0.1309 - acc: 0.9880Epoch 00056: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1320 - acc: 0.9875 - val_loss: 0.4757 - val_acc: 0.8904
Epoch 58/200
190/191 [============================>.] - ETA: 0s - loss: 0.1219 - acc: 0.9899Epoch 00057: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1219 - acc: 0.9899 - val_loss: 0.2963 - val_acc: 0.9333
Epoch 59/200
190/191 [============================>.] - ETA: 0s - loss: 0.1206 - acc: 0.9900Epoch 00058: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1209 - acc: 0.9901 - val_loss: 0.2313 - val_acc: 0.9578
Epoch 60/200
190/191 [============================>.] - ETA: 0s - loss: 0.1193 - acc: 0.9898Epoch 00059: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1198 - acc: 0.9893 - val_loss: 0.2172 - val_acc: 0.9657
Epoch 61/200
190/191 [============================>.] - ETA: 0s - loss: 0.1184 - acc: 0.9894Epoch 00060: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1183 - acc: 0.9894 - val_loss: 0.2525 - val_acc: 0.9512
Epoch 62/200
190/191 [============================>.] - ETA: 0s - loss: 0.1115 - acc: 0.9906Epoch 00061: val_acc improved from 0.96832 to 0.96898, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.1114 - acc: 0.9907 - val_loss: 0.2203 - val_acc: 0.9690
Epoch 63/200
190/191 [============================>.] - ETA: 0s - loss: 0.1124 - acc: 0.9896Epoch 00062: val_acc improved from 0.96898 to 0.97294, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.1124 - acc: 0.9896 - val_loss: 0.1889 - val_acc: 0.9729
Epoch 64/200
190/191 [============================>.] - ETA: 0s - loss: 0.1149 - acc: 0.9879Epoch 00063: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1148 - acc: 0.9880 - val_loss: 0.1983 - val_acc: 0.9644
Epoch 65/200
190/191 [============================>.] - ETA: 0s - loss: 0.1115 - acc: 0.9892Epoch 00064: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1113 - acc: 0.9893 - val_loss: 0.2228 - val_acc: 0.9571
Epoch 66/200
190/191 [============================>.] - ETA: 0s - loss: 0.1083 - acc: 0.9899Epoch 00065: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1083 - acc: 0.9899 - val_loss: 0.2098 - val_acc: 0.9611
Epoch 67/200
190/191 [============================>.] - ETA: 0s - loss: 0.1057 - acc: 0.9911Epoch 00066: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1056 - acc: 0.9912 - val_loss: 0.2389 - val_acc: 0.9558
Epoch 68/200
190/191 [============================>.] - ETA: 0s - loss: 0.1054 - acc: 0.9907Epoch 00067: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1053 - acc: 0.9908 - val_loss: 0.2340 - val_acc: 0.9531
Epoch 69/200
190/191 [============================>.] - ETA: 0s - loss: 0.1074 - acc: 0.9895Epoch 00068: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1072 - acc: 0.9895 - val_loss: 0.2155 - val_acc: 0.9584
Epoch 70/200
190/191 [============================>.] - ETA: 0s - loss: 0.1055 - acc: 0.9898Epoch 00069: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1055 - acc: 0.9899 - val_loss: 0.2354 - val_acc: 0.9564
Epoch 71/200
190/191 [============================>.] - ETA: 0s - loss: 0.1001 - acc: 0.9924Epoch 00070: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.1000 - acc: 0.9925 - val_loss: 0.2307 - val_acc: 0.9597
Epoch 72/200
190/191 [============================>.] - ETA: 0s - loss: 0.1000 - acc: 0.9914Epoch 00071: val_acc did not improve

Epoch 00071: reducing learning rate to 6.25000029685907e-05.
191/191 [==============================] - 71s - loss: 0.0999 - acc: 0.9915 - val_loss: 0.3140 - val_acc: 0.9327
Epoch 73/200
190/191 [============================>.] - ETA: 0s - loss: 0.0962 - acc: 0.9919Epoch 00072: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.0962 - acc: 0.9919 - val_loss: 0.1849 - val_acc: 0.9683
Epoch 74/200
190/191 [============================>.] - ETA: 0s - loss: 0.0880 - acc: 0.9953Epoch 00073: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.0879 - acc: 0.9953 - val_loss: 0.1993 - val_acc: 0.9644
Epoch 75/200
190/191 [============================>.] - ETA: 0s - loss: 0.0873 - acc: 0.9951Epoch 00074: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.0872 - acc: 0.9951 - val_loss: 0.1686 - val_acc: 0.9703
Epoch 76/200
190/191 [============================>.] - ETA: 0s - loss: 0.0852 - acc: 0.9959Epoch 00075: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.0852 - acc: 0.9959 - val_loss: 0.1999 - val_acc: 0.9683
Epoch 77/200
190/191 [============================>.] - ETA: 0s - loss: 0.0873 - acc: 0.9942Epoch 00076: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.0872 - acc: 0.9942 - val_loss: 0.2420 - val_acc: 0.9545
Epoch 78/200
190/191 [============================>.] - ETA: 0s - loss: 0.0833 - acc: 0.9960Epoch 00077: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.0832 - acc: 0.9960 - val_loss: 0.1968 - val_acc: 0.9604
Epoch 79/200
190/191 [============================>.] - ETA: 0s - loss: 0.0836 - acc: 0.9952Epoch 00078: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.0836 - acc: 0.9953 - val_loss: 0.1667 - val_acc: 0.9716
Epoch 80/200
190/191 [============================>.] - ETA: 0s - loss: 0.0829 - acc: 0.9954Epoch 00079: val_acc did not improve

Epoch 00079: reducing learning rate to 3.125000148429535e-05.
191/191 [==============================] - 71s - loss: 0.0828 - acc: 0.9954 - val_loss: 0.1763 - val_acc: 0.9716
Epoch 81/200
190/191 [============================>.] - ETA: 0s - loss: 0.0805 - acc: 0.9966Epoch 00080: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.0820 - acc: 0.9961 - val_loss: 0.1941 - val_acc: 0.9716
Epoch 82/200
190/191 [============================>.] - ETA: 0s - loss: 0.0797 - acc: 0.9961Epoch 00081: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.0798 - acc: 0.9961 - val_loss: 0.1909 - val_acc: 0.9663
Epoch 83/200
190/191 [============================>.] - ETA: 0s - loss: 0.0766 - acc: 0.9972Epoch 00082: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.0770 - acc: 0.9972 - val_loss: 0.1805 - val_acc: 0.9690
Epoch 84/200
190/191 [============================>.] - ETA: 0s - loss: 0.0757 - acc: 0.9971Epoch 00083: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.0757 - acc: 0.9971 - val_loss: 0.1899 - val_acc: 0.9690
Epoch 00083: early stopping
Loading best model from check-point and testing...
                 precision    recall  f1-score   support

      12-8-Time       1.00      1.00      1.00        40
       2-2-Time       1.00      1.00      1.00        39
       2-4-Time       1.00      0.97      0.99        40
       3-4-Time       0.98      1.00      0.99        40
       3-8-Time       1.00      0.93      0.96        40
       4-4-Time       0.98      1.00      0.99        40
       6-8-Time       0.98      1.00      0.99        40
       9-8-Time       0.98      1.00      0.99        40
        Barline       0.98      1.00      0.99        40
         C-Clef       1.00      1.00      1.00        40
    Common-Time       1.00      1.00      1.00        40
       Cut-Time       1.00      1.00      1.00        40
            Dot       0.97      0.97      0.97        40
   Double-Sharp       0.98      1.00      0.99        40
    Eighth-Note       0.96      0.97      0.97        80
    Eighth-Rest       0.95      0.97      0.96        40
         F-Clef       0.98      1.00      0.99        40
           Flat       0.97      0.97      0.97        39
         G-Clef       1.00      1.00      1.00        40
      Half-Note       0.99      1.00      0.99        79
        Natural       1.00      0.93      0.96        40
   Quarter-Note       1.00      1.00      1.00        80
   Quarter-Rest       0.90      0.88      0.89        40
          Sharp       0.97      0.95      0.96        40
 Sixteenth-Note       0.91      0.93      0.92        80
 Sixteenth-Rest       0.90      0.93      0.91        40
Sixty-Four-Note       0.97      0.94      0.95        79
Sixty-Four-Rest       0.97      0.93      0.95        40
Thirty-Two-Note       0.89      0.92      0.91        79
Thirty-Two-Rest       0.95      0.88      0.91        40
Whole-Half-Rest       0.95      0.97      0.96        40
     Whole-Note       0.98      1.00      0.99        40

    avg / total       0.97      0.97      0.97      1515

Total Loss: 0.18774
Total Accuracy: 96.83168%
Total Error: 3.16832%
Execution time: 6054.3s
