C:\Programming\Anaconda3-4.2.0\python.exe C:/Users/Alex/Repositories/MusicSymbolClassifier/ModelGenerator/TrainModel.py --delete_and_recreate_dataset_directory False --model_name vgg4
Using TensorFlow backend.
Training on dataset...
Found 12170 images belonging to 32 classes.
Found 1515 images belonging to 32 classes.
Found 1515 images belonging to 32 classes.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 244, 128, 32)      896       
_________________________________________________________________
batch_normalization_1 (Batch (None, 244, 128, 32)      128       
_________________________________________________________________
activation_1 (Activation)    (None, 244, 128, 32)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 244, 128, 32)      9248      
_________________________________________________________________
batch_normalization_2 (Batch (None, 244, 128, 32)      128       
_________________________________________________________________
activation_2 (Activation)    (None, 244, 128, 32)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 122, 64, 32)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 122, 64, 64)       18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 122, 64, 64)       256       
_________________________________________________________________
activation_3 (Activation)    (None, 122, 64, 64)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 122, 64, 64)       36928     
_________________________________________________________________
batch_normalization_4 (Batch (None, 122, 64, 64)       256       
_________________________________________________________________
activation_4 (Activation)    (None, 122, 64, 64)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 61, 32, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 61, 32, 128)       73856     
_________________________________________________________________
batch_normalization_5 (Batch (None, 61, 32, 128)       512       
_________________________________________________________________
activation_5 (Activation)    (None, 61, 32, 128)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 61, 32, 128)       147584    
_________________________________________________________________
batch_normalization_6 (Batch (None, 61, 32, 128)       512       
_________________________________________________________________
activation_6 (Activation)    (None, 61, 32, 128)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 61, 32, 128)       147584    
_________________________________________________________________
batch_normalization_7 (Batch (None, 61, 32, 128)       512       
_________________________________________________________________
activation_7 (Activation)    (None, 61, 32, 128)       0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 30, 16, 128)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 30, 16, 256)       295168    
_________________________________________________________________
batch_normalization_8 (Batch (None, 30, 16, 256)       1024      
_________________________________________________________________
activation_8 (Activation)    (None, 30, 16, 256)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 30, 16, 256)       590080    
_________________________________________________________________
batch_normalization_9 (Batch (None, 30, 16, 256)       1024      
_________________________________________________________________
activation_9 (Activation)    (None, 30, 16, 256)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 30, 16, 256)       590080    
_________________________________________________________________
batch_normalization_10 (Batc (None, 30, 16, 256)       1024      
_________________________________________________________________
activation_10 (Activation)   (None, 30, 16, 256)       0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 15, 8, 256)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 15, 8, 512)        1180160   
_________________________________________________________________
batch_normalization_11 (Batc (None, 15, 8, 512)        2048      
_________________________________________________________________
activation_11 (Activation)   (None, 15, 8, 512)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 15, 8, 512)        2359808   
_________________________________________________________________
batch_normalization_12 (Batc (None, 15, 8, 512)        2048      
_________________________________________________________________
activation_12 (Activation)   (None, 15, 8, 512)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 15, 8, 512)        2359808   
_________________________________________________________________
batch_normalization_13 (Batc (None, 15, 8, 512)        2048      
_________________________________________________________________
activation_13 (Activation)   (None, 15, 8, 512)        0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 7, 4, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 14336)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                458784    
_________________________________________________________________
output_node (Activation)     (None, 32)                0         
=================================================================
Total params: 8,280,000
Trainable params: 8,274,240
Non-trainable params: 5,760
_________________________________________________________________
Model vgg4 loaded.
Training for 200 epochs with initial learning rate of 0.001, weight-decay of 0.0001 and Nesterov Momentum of 0.9 ...
Additional parameters: Initialization: he_normal, Minibatch-size: 64, Early stopping after 10 epochs without improvement
Data-Shape: (244, 128, 3), Reducing learning rate by factor to 0.5 respectively if not improved validation accuracy after 5 epochs
Data-augmentation: Zooming 20.0% randomly, rotating 10° randomly
Epoch 1/200
2017-05-26 20:14:11.850566: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE instructions, but these are available on your machine and could speed up CPU computations.
2017-05-26 20:14:11.850803: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE2 instructions, but these are available on your machine and could speed up CPU computations.
2017-05-26 20:14:11.851019: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE3 instructions, but these are available on your machine and could speed up CPU computations.
2017-05-26 20:14:11.851236: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE4.1 instructions, but these are available on your machine and could speed up CPU computations.
2017-05-26 20:14:11.851455: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE4.2 instructions, but these are available on your machine and could speed up CPU computations.
2017-05-26 20:14:11.851679: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use AVX instructions, but these are available on your machine and could speed up CPU computations.
2017-05-26 20:14:11.851909: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use AVX2 instructions, but these are available on your machine and could speed up CPU computations.
2017-05-26 20:14:11.852145: W c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\platform\cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use FMA instructions, but these are available on your machine and could speed up CPU computations.
2017-05-26 20:14:12.212550: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:887] Found device 0 with properties: 
name: GeForce GTX 1080 Ti
major: 6 minor: 1 memoryClockRate (GHz) 1.582
pciBusID 0000:01:00.0
Total memory: 11.00GiB
Free memory: 9.12GiB
2017-05-26 20:14:12.212829: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:908] DMA: 0 
2017-05-26 20:14:12.212948: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:918] 0:   Y 
2017-05-26 20:14:12.213079: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\gpu_device.cc:977] Creating TensorFlow device (/gpu:0) -> (device: 0, name: GeForce GTX 1080 Ti, pci bus id: 0000:01:00.0)
 10/191 [>.............................] - ETA: 172s - loss: 3.6038 - acc: 0.08752017-05-26 20:14:21.155547: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\pool_allocator.cc:247] PoolAllocator: After 3729 get requests, put_count=3728 evicted_count=1000 eviction_rate=0.26824 and unsatisfied allocation rate=0.295253
2017-05-26 20:14:21.155997: I c:\tf_jenkins\home\workspace\release-win\device\gpu\os\windows\tensorflow\core\common_runtime\gpu\pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
190/191 [============================>.] - ETA: 0s - loss: 1.3729 - acc: 0.6696Epoch 00000: val_acc improved from -inf to 0.26403, saving model to vgg4.h5
191/191 [==============================] - 79s - loss: 1.3689 - acc: 0.6708 - val_loss: 2.3568 - val_acc: 0.2640
Epoch 2/200
190/191 [============================>.] - ETA: 0s - loss: 0.6375 - acc: 0.8753Epoch 00001: val_acc improved from 0.26403 to 0.77558, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.6396 - acc: 0.8739 - val_loss: 0.9383 - val_acc: 0.7756
Epoch 3/200
190/191 [============================>.] - ETA: 0s - loss: 0.5440 - acc: 0.9072Epoch 00002: val_acc improved from 0.77558 to 0.89637, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.5434 - acc: 0.9076 - val_loss: 0.5518 - val_acc: 0.8964
Epoch 4/200
190/191 [============================>.] - ETA: 0s - loss: 0.4804 - acc: 0.9262Epoch 00003: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.4799 - acc: 0.9265 - val_loss: 0.6376 - val_acc: 0.8792
Epoch 5/200
190/191 [============================>.] - ETA: 0s - loss: 0.4401 - acc: 0.9390Epoch 00004: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.4408 - acc: 0.9388 - val_loss: 0.8969 - val_acc: 0.7835
Epoch 6/200
190/191 [============================>.] - ETA: 0s - loss: 0.4212 - acc: 0.9456Epoch 00005: val_acc improved from 0.89637 to 0.91485, saving model to vgg4.h5
191/191 [==============================] - 72s - loss: 0.4212 - acc: 0.9459 - val_loss: 0.4970 - val_acc: 0.9149
Epoch 7/200
190/191 [============================>.] - ETA: 0s - loss: 0.4120 - acc: 0.9484Epoch 00006: val_acc improved from 0.91485 to 0.94191, saving model to vgg4.h5
191/191 [==============================] - 72s - loss: 0.4113 - acc: 0.9486 - val_loss: 0.4303 - val_acc: 0.9419
Epoch 8/200
190/191 [============================>.] - ETA: 0s - loss: 0.3879 - acc: 0.9555Epoch 00007: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.3883 - acc: 0.9557 - val_loss: 0.6800 - val_acc: 0.8785
Epoch 9/200
190/191 [============================>.] - ETA: 0s - loss: 0.3770 - acc: 0.9590Epoch 00008: val_acc improved from 0.94191 to 0.94257, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.3767 - acc: 0.9593 - val_loss: 0.4318 - val_acc: 0.9426
Epoch 10/200
190/191 [============================>.] - ETA: 0s - loss: 0.3620 - acc: 0.9670Epoch 00009: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.3615 - acc: 0.9672 - val_loss: 0.4534 - val_acc: 0.9399
Epoch 11/200
190/191 [============================>.] - ETA: 0s - loss: 0.3546 - acc: 0.9683Epoch 00010: val_acc improved from 0.94257 to 0.94917, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.3543 - acc: 0.9685 - val_loss: 0.4081 - val_acc: 0.9492
Epoch 12/200
190/191 [============================>.] - ETA: 0s - loss: 0.3501 - acc: 0.9688Epoch 00011: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.3499 - acc: 0.9690 - val_loss: 0.8752 - val_acc: 0.7993
Epoch 13/200
190/191 [============================>.] - ETA: 0s - loss: 0.3351 - acc: 0.9756Epoch 00012: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.3348 - acc: 0.9757 - val_loss: 0.5034 - val_acc: 0.9175
Epoch 14/200
190/191 [============================>.] - ETA: 0s - loss: 0.3328 - acc: 0.9758Epoch 00013: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.3326 - acc: 0.9759 - val_loss: 0.4607 - val_acc: 0.9307
Epoch 15/200
190/191 [============================>.] - ETA: 0s - loss: 0.3283 - acc: 0.9781Epoch 00014: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.3286 - acc: 0.9777 - val_loss: 0.4342 - val_acc: 0.9380
Epoch 16/200
190/191 [============================>.] - ETA: 0s - loss: 0.3261 - acc: 0.9790Epoch 00015: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.3259 - acc: 0.9791 - val_loss: 0.4825 - val_acc: 0.9287
Epoch 17/200
190/191 [============================>.] - ETA: 0s - loss: 0.3211 - acc: 0.9779Epoch 00016: val_acc improved from 0.94917 to 0.95248, saving model to vgg4.h5
191/191 [==============================] - 72s - loss: 0.3209 - acc: 0.9780 - val_loss: 0.4082 - val_acc: 0.9525
Epoch 18/200
190/191 [============================>.] - ETA: 0s - loss: 0.3232 - acc: 0.9783Epoch 00017: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.3243 - acc: 0.9779 - val_loss: 0.6464 - val_acc: 0.8739
Epoch 19/200
190/191 [============================>.] - ETA: 0s - loss: 0.3257 - acc: 0.9776Epoch 00018: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.3261 - acc: 0.9772 - val_loss: 0.5384 - val_acc: 0.9168
Epoch 20/200
190/191 [============================>.] - ETA: 0s - loss: 0.3124 - acc: 0.9840Epoch 00019: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.3123 - acc: 0.9841 - val_loss: 0.4712 - val_acc: 0.9287
Epoch 21/200
190/191 [============================>.] - ETA: 0s - loss: 0.3054 - acc: 0.9853Epoch 00020: val_acc improved from 0.95248 to 0.96040, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.3055 - acc: 0.9854 - val_loss: 0.3783 - val_acc: 0.9604
Epoch 22/200
190/191 [============================>.] - ETA: 0s - loss: 0.3045 - acc: 0.9858Epoch 00021: val_acc improved from 0.96040 to 0.96172, saving model to vgg4.h5
191/191 [==============================] - 72s - loss: 0.3044 - acc: 0.9858 - val_loss: 0.3701 - val_acc: 0.9617
Epoch 23/200
190/191 [============================>.] - ETA: 0s - loss: 0.2950 - acc: 0.9896Epoch 00022: val_acc improved from 0.96172 to 0.96172, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.2953 - acc: 0.9891 - val_loss: 0.3821 - val_acc: 0.9617
Epoch 24/200
190/191 [============================>.] - ETA: 0s - loss: 0.2986 - acc: 0.9876Epoch 00023: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2986 - acc: 0.9876 - val_loss: 0.4079 - val_acc: 0.9571
Epoch 25/200
190/191 [============================>.] - ETA: 0s - loss: 0.2973 - acc: 0.9874Epoch 00024: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2982 - acc: 0.9870 - val_loss: 0.7069 - val_acc: 0.8746
Epoch 26/200
190/191 [============================>.] - ETA: 0s - loss: 0.3001 - acc: 0.9877Epoch 00025: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.3001 - acc: 0.9878 - val_loss: 0.4098 - val_acc: 0.9617
Epoch 27/200
190/191 [============================>.] - ETA: 0s - loss: 0.2898 - acc: 0.9894Epoch 00026: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2897 - acc: 0.9894 - val_loss: 0.5168 - val_acc: 0.9102
Epoch 28/200
190/191 [============================>.] - ETA: 0s - loss: 0.2910 - acc: 0.9897Epoch 00027: val_acc improved from 0.96172 to 0.96370, saving model to vgg4.h5
191/191 [==============================] - 72s - loss: 0.2909 - acc: 0.9898 - val_loss: 0.3611 - val_acc: 0.9637
Epoch 29/200
190/191 [============================>.] - ETA: 0s - loss: 0.2834 - acc: 0.9920Epoch 00028: val_acc improved from 0.96370 to 0.96766, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.2833 - acc: 0.9921 - val_loss: 0.3684 - val_acc: 0.9677
Epoch 30/200
190/191 [============================>.] - ETA: 0s - loss: 0.2839 - acc: 0.9911Epoch 00029: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2838 - acc: 0.9912 - val_loss: 0.3843 - val_acc: 0.9591
Epoch 31/200
190/191 [============================>.] - ETA: 0s - loss: 0.2823 - acc: 0.9930Epoch 00030: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2825 - acc: 0.9930 - val_loss: 0.4766 - val_acc: 0.9307
Epoch 32/200
190/191 [============================>.] - ETA: 0s - loss: 0.2817 - acc: 0.9932Epoch 00031: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2816 - acc: 0.9932 - val_loss: 0.3686 - val_acc: 0.9624
Epoch 33/200
190/191 [============================>.] - ETA: 0s - loss: 0.2794 - acc: 0.9933Epoch 00032: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2806 - acc: 0.9929 - val_loss: 0.4003 - val_acc: 0.9479
Epoch 34/200
190/191 [============================>.] - ETA: 0s - loss: 0.2848 - acc: 0.9910Epoch 00033: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2849 - acc: 0.9910 - val_loss: 0.3661 - val_acc: 0.9663
Epoch 35/200
190/191 [============================>.] - ETA: 0s - loss: 0.2783 - acc: 0.9933Epoch 00034: val_acc did not improve

Epoch 00034: reducing learning rate to 0.0005000000237487257.
191/191 [==============================] - 71s - loss: 0.2784 - acc: 0.9933 - val_loss: 0.3817 - val_acc: 0.9624
Epoch 36/200
190/191 [============================>.] - ETA: 0s - loss: 0.2744 - acc: 0.9960Epoch 00035: val_acc improved from 0.96766 to 0.96898, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.2744 - acc: 0.9960 - val_loss: 0.3584 - val_acc: 0.9690
Epoch 37/200
190/191 [============================>.] - ETA: 0s - loss: 0.2696 - acc: 0.9972Epoch 00036: val_acc improved from 0.96898 to 0.97096, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.2695 - acc: 0.9972 - val_loss: 0.3454 - val_acc: 0.9710
Epoch 38/200
190/191 [============================>.] - ETA: 0s - loss: 0.2703 - acc: 0.9970Epoch 00037: val_acc improved from 0.97096 to 0.97492, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.2704 - acc: 0.9970 - val_loss: 0.3376 - val_acc: 0.9749
Epoch 39/200
190/191 [============================>.] - ETA: 0s - loss: 0.2676 - acc: 0.9978Epoch 00038: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2675 - acc: 0.9978 - val_loss: 0.3447 - val_acc: 0.9723
Epoch 40/200
190/191 [============================>.] - ETA: 0s - loss: 0.2693 - acc: 0.9970Epoch 00039: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2693 - acc: 0.9970 - val_loss: 0.3804 - val_acc: 0.9650
Epoch 41/200
190/191 [============================>.] - ETA: 0s - loss: 0.2677 - acc: 0.9968Epoch 00040: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2687 - acc: 0.9963 - val_loss: 0.3506 - val_acc: 0.9710
Epoch 42/200
190/191 [============================>.] - ETA: 0s - loss: 0.2687 - acc: 0.9973Epoch 00041: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2687 - acc: 0.9973 - val_loss: 0.3372 - val_acc: 0.9736
Epoch 43/200
190/191 [============================>.] - ETA: 0s - loss: 0.2665 - acc: 0.9977Epoch 00042: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2664 - acc: 0.9977 - val_loss: 0.3687 - val_acc: 0.9690
Epoch 44/200
190/191 [============================>.] - ETA: 0s - loss: 0.2662 - acc: 0.9984Epoch 00043: val_acc did not improve

Epoch 00043: reducing learning rate to 0.0002500000118743628.
191/191 [==============================] - 72s - loss: 0.2668 - acc: 0.9978 - val_loss: 0.3692 - val_acc: 0.9624
Epoch 45/200
190/191 [============================>.] - ETA: 0s - loss: 0.2690 - acc: 0.9963Epoch 00044: val_acc improved from 0.97492 to 0.97822, saving model to vgg4.h5
191/191 [==============================] - 72s - loss: 0.2690 - acc: 0.9963 - val_loss: 0.3406 - val_acc: 0.9782
Epoch 46/200
190/191 [============================>.] - ETA: 0s - loss: 0.2648 - acc: 0.9984Epoch 00045: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2651 - acc: 0.9984 - val_loss: 0.3441 - val_acc: 0.9729
Epoch 47/200
190/191 [============================>.] - ETA: 0s - loss: 0.2652 - acc: 0.9979Epoch 00046: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2651 - acc: 0.9979 - val_loss: 0.3529 - val_acc: 0.9696
Epoch 48/200
190/191 [============================>.] - ETA: 0s - loss: 0.2644 - acc: 0.9980Epoch 00047: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2644 - acc: 0.9980 - val_loss: 0.3425 - val_acc: 0.9736
Epoch 49/200
190/191 [============================>.] - ETA: 0s - loss: 0.2644 - acc: 0.9979Epoch 00048: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2643 - acc: 0.9980 - val_loss: 0.3426 - val_acc: 0.9769
Epoch 50/200
190/191 [============================>.] - ETA: 0s - loss: 0.2638 - acc: 0.9979Epoch 00049: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2637 - acc: 0.9980 - val_loss: 0.3379 - val_acc: 0.9749
Epoch 51/200
190/191 [============================>.] - ETA: 0s - loss: 0.2639 - acc: 0.9983Epoch 00050: val_acc did not improve

Epoch 00050: reducing learning rate to 0.0001250000059371814.
191/191 [==============================] - 71s - loss: 0.2641 - acc: 0.9983 - val_loss: 0.3532 - val_acc: 0.9690
Epoch 52/200
190/191 [============================>.] - ETA: 0s - loss: 0.2622 - acc: 0.9988Epoch 00051: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2622 - acc: 0.9989 - val_loss: 0.3494 - val_acc: 0.9703
Epoch 53/200
190/191 [============================>.] - ETA: 0s - loss: 0.2628 - acc: 0.9987Epoch 00052: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2630 - acc: 0.9987 - val_loss: 0.3221 - val_acc: 0.9776
Epoch 54/200
190/191 [============================>.] - ETA: 0s - loss: 0.2628 - acc: 0.9986Epoch 00053: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2627 - acc: 0.9986 - val_loss: 0.3344 - val_acc: 0.9762
Epoch 55/200
190/191 [============================>.] - ETA: 0s - loss: 0.2627 - acc: 0.9981Epoch 00054: val_acc improved from 0.97822 to 0.97888, saving model to vgg4.h5
191/191 [==============================] - 73s - loss: 0.2627 - acc: 0.9981 - val_loss: 0.3218 - val_acc: 0.9789
Epoch 56/200
190/191 [============================>.] - ETA: 0s - loss: 0.2623 - acc: 0.9988Epoch 00055: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2623 - acc: 0.9989 - val_loss: 0.3380 - val_acc: 0.9782
Epoch 57/200
190/191 [============================>.] - ETA: 0s - loss: 0.2622 - acc: 0.9986Epoch 00056: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2622 - acc: 0.9986 - val_loss: 0.3430 - val_acc: 0.9736
Epoch 58/200
190/191 [============================>.] - ETA: 0s - loss: 0.2616 - acc: 0.9988Epoch 00057: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2617 - acc: 0.9989 - val_loss: 0.3233 - val_acc: 0.9769
Epoch 59/200
190/191 [============================>.] - ETA: 0s - loss: 0.2629 - acc: 0.9981Epoch 00058: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2629 - acc: 0.9981 - val_loss: 0.3469 - val_acc: 0.9729
Epoch 60/200
190/191 [============================>.] - ETA: 0s - loss: 0.2619 - acc: 0.9988Epoch 00059: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2628 - acc: 0.9983 - val_loss: 0.3652 - val_acc: 0.9650
Epoch 61/200
190/191 [============================>.] - ETA: 0s - loss: 0.2627 - acc: 0.9983Epoch 00060: val_acc did not improve

Epoch 00060: reducing learning rate to 0.0001.
191/191 [==============================] - 72s - loss: 0.2628 - acc: 0.9983 - val_loss: 0.3443 - val_acc: 0.9749
Epoch 62/200
190/191 [============================>.] - ETA: 0s - loss: 0.2616 - acc: 0.9988Epoch 00061: val_acc improved from 0.97888 to 0.97954, saving model to vgg4.h5
191/191 [==============================] - 71s - loss: 0.2615 - acc: 0.9988 - val_loss: 0.3237 - val_acc: 0.9795
Epoch 63/200
190/191 [============================>.] - ETA: 0s - loss: 0.2621 - acc: 0.9989Epoch 00062: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2622 - acc: 0.9989 - val_loss: 0.3406 - val_acc: 0.9749
Epoch 64/200
190/191 [============================>.] - ETA: 0s - loss: 0.2612 - acc: 0.9988Epoch 00063: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2612 - acc: 0.9989 - val_loss: 0.3425 - val_acc: 0.9762
Epoch 65/200
190/191 [============================>.] - ETA: 0s - loss: 0.2615 - acc: 0.9988Epoch 00064: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2615 - acc: 0.9989 - val_loss: 0.3385 - val_acc: 0.9749
Epoch 66/200
190/191 [============================>.] - ETA: 0s - loss: 0.2611 - acc: 0.9989Epoch 00065: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2611 - acc: 0.9989 - val_loss: 0.3445 - val_acc: 0.9736
Epoch 67/200
190/191 [============================>.] - ETA: 0s - loss: 0.2609 - acc: 0.9989Epoch 00066: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2609 - acc: 0.9989 - val_loss: 0.3374 - val_acc: 0.9743
Epoch 68/200
190/191 [============================>.] - ETA: 0s - loss: 0.2607 - acc: 0.9993Epoch 00067: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2608 - acc: 0.9993 - val_loss: 0.3293 - val_acc: 0.9789
Epoch 69/200
190/191 [============================>.] - ETA: 0s - loss: 0.2611 - acc: 0.9992Epoch 00068: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2611 - acc: 0.9992 - val_loss: 0.3533 - val_acc: 0.9710
Epoch 70/200
190/191 [============================>.] - ETA: 0s - loss: 0.2615 - acc: 0.9993Epoch 00069: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2616 - acc: 0.9993 - val_loss: 0.3462 - val_acc: 0.9716
Epoch 71/200
190/191 [============================>.] - ETA: 0s - loss: 0.2622 - acc: 0.9984Epoch 00070: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2633 - acc: 0.9978 - val_loss: 0.3443 - val_acc: 0.9729
Epoch 72/200
190/191 [============================>.] - ETA: 0s - loss: 0.2631 - acc: 0.9978Epoch 00071: val_acc did not improve
191/191 [==============================] - 72s - loss: 0.2638 - acc: 0.9973 - val_loss: 0.3467 - val_acc: 0.9729
Epoch 73/200
190/191 [============================>.] - ETA: 0s - loss: 0.2615 - acc: 0.9989Epoch 00072: val_acc did not improve
191/191 [==============================] - 71s - loss: 0.2616 - acc: 0.9989 - val_loss: 0.3429 - val_acc: 0.9729
Epoch 00072: early stopping
Loading best model from check-point and testing...
                 precision    recall  f1-score   support

      12-8-Time       1.00      1.00      1.00        40
       2-2-Time       1.00      1.00      1.00        39
       2-4-Time       0.97      0.97      0.97        40
       3-4-Time       1.00      0.97      0.99        40
       3-8-Time       1.00      1.00      1.00        40
       4-4-Time       0.95      1.00      0.98        40
       6-8-Time       1.00      1.00      1.00        40
       9-8-Time       1.00      1.00      1.00        40
        Barline       0.98      1.00      0.99        40
         C-Clef       1.00      1.00      1.00        40
    Common-Time       1.00      1.00      1.00        40
       Cut-Time       1.00      1.00      1.00        40
            Dot       0.97      0.97      0.97        40
   Double-Sharp       1.00      0.97      0.99        40
    Eighth-Note       0.97      0.96      0.97        80
    Eighth-Rest       1.00      0.97      0.99        40
         F-Clef       0.98      1.00      0.99        40
           Flat       1.00      0.97      0.99        39
         G-Clef       1.00      1.00      1.00        40
      Half-Note       1.00      0.99      0.99        79
        Natural       1.00      0.93      0.96        40
   Quarter-Note       0.99      1.00      0.99        80
   Quarter-Rest       0.90      0.95      0.93        40
          Sharp       1.00      0.95      0.97        40
 Sixteenth-Note       0.92      0.96      0.94        80
 Sixteenth-Rest       0.95      0.95      0.95        40
Sixty-Four-Note       0.96      0.96      0.96        79
Sixty-Four-Rest       0.97      0.95      0.96        40
Thirty-Two-Note       0.94      0.91      0.92        79
Thirty-Two-Rest       0.95      0.95      0.95        40
Whole-Half-Rest       0.93      0.97      0.95        40
     Whole-Note       0.98      1.00      0.99        40

    avg / total       0.98      0.98      0.98      1515

Total Loss: 0.33791
Total Accuracy: 97.55776%
Total Error: 2.44224%
Execution time: 5282.0s
